# Import
# -----------------------------------------------------------------------------
from __future__ import annotations

import enum
from typing import ClassVar

import deepl
import googletrans
import regex


# Classes
# -----------------------------------------------------------------------------
# ----------------------------------------------------------------------
@enum.unique
class TERTransService(enum.Enum):
    DEEPLKEY = enum.auto()
    DEEPLTRANSLATE = enum.auto()
    GOOGLETRANS = enum.auto()
    GOOGLEGAS = enum.auto()

    @classmethod
    def get(cls, s: str) -> TERTransService | None:
        for e in [_e for _e in TERTransService]:
            if s.casefold().strip() == e.name.casefold().strip():
                return e
        return None


# ----------------------------------------------------------------------
class TERLang:
    __JAPANESE_KANJIS_SEQUENCE_1ST: ClassVar[str] = (
        "一丁七万丈三上下不与丑且世丘丙丞両並中串丸丹主乃久之乍乎乏乗乙九乞也乱乳乾亀"
        "了予争事二云互五井亘亙些亜亡交亥亦亨享京亭亮人什仁仇今介仏仔仕他付仙代令以仮"
        "仰仲件任企伊伍伎伏伐休会伝伯伴伶伸伺似伽佃但位低住佐佑体何余作佳併佼使侃例侍"
        "供依侠価侭侮侯侵侶便係促俄俊俗保信俣修俳俵俸俺倉個倍倒倖候借倣値倦倫倭倶倹偉"
        "偏停健偲側偵偶偽傍傑傘備催傭債傷傾僅働像僑僕僚僧僻儀億儒償優儲允元兄充兆兇先"
        "光克免兎児党兜入全八公六共兵其具典兼内円冊再冒冗写冠冥冨冬冴冶冷凄准凋凌凍凝"
        "凡処凧凪凱凶凸凹出函刀刃分切刈刊刑列初判別利到制刷券刺刻剃則削前剖剛剣剤剥副"
        "剰割創劃劇劉力功加劣助努劫励労効劾勃勅勇勉動勘務勝募勢勤勧勲勺勾勿匁匂包化北"
        "匙匝匠匡匪匹区医匿十千升午半卑卒卓協南単博卜占卦卯印危即却卵卸卿厄厘厚原厨厩"
        "厭厳去参又叉及友双反収叔取受叙叛叡叢口古句叩只叫召可台叱史右叶号司吃各合吉吊"
        "吋同名后吏吐向君吟吠否含吸吹吻吾呂呆呈呉告呑周呪味呼命咋和咲咳咽哀品哉員哨哩"
        "哲唄唆唇唐唖唯唱唾啄商問啓善喉喋喚喜喝喧喪喫喬喰営嗣嘆嘉嘗嘘嘩嘱噂噌噛器噴噸"
        "噺嚇嚢囚四回因団困囲図固国圃圏園土圧在圭地坂均坊坐坑坤坦坪垂型垢垣埋城埜域埠"
        "埴執培基埼堀堂堅堆堕堤堪堰報場堵堺塀塁塊塑塔塗塘塙塚塞塩填塵塾境墓増墜墨墳墾"
        "壁壇壊壌壕士壬壮声壱売壷変夏夕外夙多夜夢大天太夫央失夷奄奇奈奉奏契奔套奥奨奪"
        "奮女奴好如妃妄妊妓妖妙妥妨妬妹妻妾姉始姐姑姓委姥姦姪姫姶姻姿威娃娘娠娩娯娼婁"
        "婆婚婦婿媒媛嫁嫉嫌嫡嬉嬢嬬嬰子孔字存孜孝孟季孤学孫宅宇守安宋完宍宏宕宗官宙定"
        "宛宜宝実客宣室宥宮宰害宴宵家容宿寂寄寅密富寒寓寛寝察寡寧審寮寵寸寺対寿封専射"
        "将尉尊尋導小少尖尚尤尭就尺尻尼尽尾尿局居屈届屋屍屑展属屠屡層履屯山岐岡岨岩岬"
        "岱岳岸峠峡峨峯峰島峻崇崎崖崩嵐嵩嵯嶋嶺巌川州巡巣工左巧巨差己巳巴巷巻巽巾市布"
        "帆希帖帝帥師席帯帰帳常帽幅幌幕幡幣干平年幸幹幻幼幽幾庁広庄庇床序底庖店庚府度"
        "座庫庭庵庶康庸廃廉廊廓廟廠延廷建廻廼廿弁弄弊式弐弓弔引弗弘弛弟弥弦弧弱張強弼"
        "弾彊当形彦彩彪彫彬彰影役彼往征径待律後徐徒従得御復循微徳徴徹徽心必忌忍志忘忙"
        "応忠快念忽怒怖怜思怠急性怨怪怯恋恐恒恕恢恥恨恩恭息恰恵悉悌悔悟悠患悦悩悪悲悶"
        "悼情惇惑惚惜惟惣惨惰想惹愁愈愉意愚愛感慈態慌慎慕慢慣慧慨慮慰慶慾憂憎憐憤憧憩"
        "憲憶憾懇懐懲懸戊戎成我戒或戚戟戦戯戴戸戻房所扇扉手才打払托扮扱扶批承技抄把抑"
        "投抗折抜択披抱抵抹押抽担拍拐拒拓拘拙招拝拠拡括拭拳拶拷拾持指按挑挙挟挨挫振挺"
        "挽挿捉捌捕捗捜捧捨据捲捷捺捻掃授掌排掘掛掠採探接控推掩措掬掲掴掻揃描提揖揚換"
        "握揮援揺損搬搭携搾摂摘摩摸摺撃撒撚撞撤撫播撮撰撲撹擁操擢擦擬擾支改攻放政故敏"
        "救敗教敢散敦敬数整敵敷文斉斌斎斐斑斗料斜斡斤斥斧斬断斯新方於施旅旋族旗既日旦"
        "旧旨早旬旭旺昂昆昇昌明昏易昔星映春昧昨昭是昼時晃晋晒晦晩普景晴晶智暁暇暑暖暗"
        "暢暦暫暮暴曇曙曜曝曲曳更書曹曽曾替最月有朋服朔朕朗望朝期木未末本札朱朴机朽杉"
        "李杏材村杓杖杜束条杢来杭杯東杵杷松板枇析枕林枚果枝枠枢枯架柁柄柊柏某柑染柔柘"
        "柚柱柳柴柵査柾柿栂栃栄栓栖栗校栢株栴核根格栽桁桂桃案桐桑桓桔桜桝桟桧桶梁梅梓"
        "梗梢梧梨梯械梱梶梼棄棉棋棒棚棟森棲棺椀椅椋植椎椙椛検椴椿楊楓楕楚楠楢業楯楳極"
        "楼楽概榊榎榔榛構槌槍様槙槻槽樋樗標樟模権横樫樵樹樺樽橋橘機橡橿檀檎櫓櫛櫨欄欝"
        "欠次欣欧欲欺欽款歌歎歓止正此武歩歪歯歳歴死殆殉殊残殖殴段殺殻殿毅母毎毒比毘毛"
        "氏民気水氷永氾汀汁求汎汐汗汚汝江池汰汲決汽沃沈沌沓沖沙没沢沫河沸油治沼沿況泉"
        "泊泌法泡波泣泥注泰泳洋洗洛洞津洩洪洲活派流浄浅浜浦浩浪浬浮浴海浸消涌涙涛涜涯"
        "液涼淀淋淑淘淡淫深淳淵混添清渇済渉渋渓渚減渠渡渥渦温測港湊湖湘湛湧湯湾湿満溌"
        "源準溜溝溢溶溺滅滋滑滝滞滴漁漂漆漉漏演漕漠漢漣漫漬漸潅潔潜潟潤潮潰澄澗澱激濁"
        "濃濠濡濫濯瀕瀞瀦瀧瀬灘火灯灰灸灼災炉炊炎炭点為烈烏烹焔焚無焦然焼煉煎煙煤照煩"
        "煮煽熊熔熟熱燃燈燐燕燥燦燭爆爪爵父爺爽爾片版牌牒牙牛牝牟牡牢牧物牲特牽犀犠犬"
        "犯状狂狐狗狙狛狩独狭狸狼狽猛猟猪猫献猶猷猿獄獅獣獲玄率玉王玖玩玲珂珊珍珠珪班"
        "現球理琉琢琳琴琵琶瑚瑛瑞瑠瑳璃環璽瓜瓢瓦瓶甑甘甚甜生産甥用甫田由甲申男町画界"
        "畏畑畔留畜畝畠畢略畦番異畳畷畿疋疎疏疑疫疲疹疾病症痔痕痘痛痢痩痴療癌癒癖発登"
        "白百的皆皇皐皮皿盃盆盈益盗盛盟監盤目盲直相盾省眉看県真眠眺眼着睡督睦瞥瞬瞭瞳"
        "矛矢知矧矩短矯石砂研砕砥砦砧砲破砺砿硝硫硬硯硲碁碇碍碑碓碕碗碧碩確磁磐磨磯礁"
        "礎示礼社祁祇祈祉祐祖祝神祢祥票祭祷禁禄禅禍禎福禦禰禽禾禿秀私秋科秒秘租秤秦秩"
        "称移稀程税稔稗稚稜種稲稼稽稿穀穂穆積穎穏穐穣穫穴究空穿突窃窄窒窓窟窪窮窯窺竃"
        "立竜章竣童竪端競竹竺竿笈笑笛笠笥符第笹筆筈等筋筏筑筒答策箆箇箔箕算管箪箭箱箸"
        "節範篇築篠篤篭簡簸簾簿籍米籾粁粂粉粋粍粒粕粗粘粛粟粥粧精糊糎糖糞糟糠糧糸系糾"
        "紀約紅紋納紐純紗紘紙級紛素紡索紫紬累細紳紹紺終絃組経結絞絡絢給統絵絶絹継続綜"
        "綬維綱網綴綻綾綿緊緋総緑緒線締編緩緬緯練縁縄縛縞縦縫縮績繁繊繋繍織繕繭繰纂纏"
        "缶罪罫置罰署罵罷羅羊美群羨義羽翁翌習翠翫翰翻翼耀老考者而耐耕耗耳耶耽聖聞聡聯"
        "聴職聾肇肉肋肌肖肘肝股肢肥肩肪肯肱育肴肺胃胆背胎胞胡胤胴胸能脂脅脆脇脈脊脚脱"
        "脳脹腎腐腔腕腫腰腸腹腺腿膏膚膜膝膨膳膿臆臓臣臥臨自臭至致臼興舌舎舗舘舛舜舞舟"
        "航般舵舶舷船艇艦艮良色艶芋芙芝芥芦芭芯花芳芸芹芽苅苑苓苔苗苛若苦苧苫英茂茄茅"
        "茎茜茨茶茸草荊荏荒荘荷荻莞莫莱菅菊菌菓菖菜菟菩華菰菱萄萌萎萩萱落葉葎著葛葡董"
        "葦葬葱葵葺蒋蒐蒔蒙蒜蒲蒸蒼蓄蓉蓋蓑蓬蓮蔀蔑蔓蔚蔦蔭蔵蔽蕃蕉蕊蕎蕗蕨蕩蕪薄薗薙"
        "薦薩薪薫薬薮薯藁藍藤藩藷藻蘇蘭虎虐虚虜虞虫虹虻蚊蚕蚤蛇蛋蛍蛎蛙蛤蛭蛮蛸蛾蜂蜘"
        "蜜蝉蝋蝕蝦蝶蝿融螺蟹蟻血衆行術街衛衝衡衣表衰衷衿袈袋袖被袴袷裁裂装裏裕補裟裡"
        "裳裸製裾複褐褒襖襟襲西要覆覇見規視覗覚覧親観角解触言訂計訊討訓託記訟訣訪設許"
        "訳訴診註証詐詑詔評詞詠詣試詩詫詮詰話該詳誇誉誌認誓誕誘語誠誤説読誰課誹誼調談"
        "請諌諏諒論諜諦諭諮諸諺諾謀謁謂謄謎謙講謝謡謬謹識譜警議譲護讃讐谷豆豊豚象豪豹"
        "貌貝貞負財貢貧貨販貫責貯貰貴買貸費貼貿賀賂賃賄資賊賎賑賓賛賜賞賠賢賦質賭購贈"
        "贋赤赦赫走赴起超越趣趨足距跡跨路跳践踊踏蹄蹟蹴躍身躯車軌軍軒軟転軸軽較載輔輝"
        "輩輪輯輸輿轄轍轟轡辛辞辰辱農辺辻込辿迂迄迅迎近返迦迩迫迭述迷追退送逃逆透逐逓"
        "途逗這通逝速造逢連逮週進逸逼遁遂遅遇遊運遍過道達違遜遠遡遣遥適遭遮遵遷選遺遼"
        "避還邑那邦邪邸郁郊郎郡部郭郵郷都鄭酉酋酌配酎酒酔酢酪酬酵酷酸醇醍醐醒醗醜醤醸"
        "釆采釈里重野量金釘釜針釣釦釧鈍鈎鈴鈷鉄鉛鉢鉦鉱鉾銀銃銅銑銘銚銭鋒鋤鋪鋭鋲鋳鋸"
        "鋼錆錐錘錠錦錨錫錬錯録鍋鍍鍔鍛鍬鍵鍾鎌鎖鎗鎚鎧鎮鏑鏡鐘鐙鐸鑑鑓長門閃閉開閏閑"
        "間関閣閤閥閲闇闘阜阪防阻阿陀附降限陛院陣除陥陪陰陳陵陶陸険陽隅隆隈隊階随隔隙"
        "際障隠隣隷隻隼雀雁雄雅集雇雌雑雛離難雨雪雫雰雲零雷電需震霊霜霞霧露青靖静非面"
        "革靭靴鞄鞍鞘鞠鞭韓韮音韻響頁頂頃項順須預頑頒頓頗領頚頬頭頴頻頼題額顎顔顕願顛"
        "類顧風飛食飢飯飲飴飼飽飾餅養餌餐餓館饗首香馨馬馳馴駁駄駅駆駈駐駒駕駿騎騒験騨"
        "騰驚骨骸髄高髪髭鬼魁魂魅魔魚魯鮎鮒鮪鮫鮭鮮鯉鯖鯛鯨鯵鰍鰐鰭鰯鰹鰻鱈鱒鱗鳥鳩鳳"
        "鳴鳶鴇鴎鴛鴨鴫鴬鴻鵜鵠鵡鵬鶏鶴鷲鷹鷺鹸鹿麓麗麟麦麹麺麻麿黄黍黒黙黛鼎鼓鼠鼻齢"
        "龍"
    )
    __JAPANESE_KANJIS_SEQUENCE_2ND_JOYO: ClassVar[
        str
    ] = "丼傲刹哺喩嗅嘲彙恣惧慄憬拉摯曖楷毀璧瘍箋籠緻羞訃諧貪踪辣錮鬱"
    __JAPANESE_KANJIS_SEQUENCE_3RD_JOYO: ClassVar[str] = "頰塡剝𠮟"
    __p_ja_kana: ClassVar[regex.Pattern[str]] = regex.compile(
        r"[\p{Script=Hiragana}\p{Script=Katakana}]"
    )
    __p_ja_kanji: ClassVar[regex.Pattern[str]] = regex.compile(
        rf"[{__JAPANESE_KANJIS_SEQUENCE_1ST}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_2ND_JOYO}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_3RD_JOYO}]"
    )
    #
    __CHINESE_KANJIS_SEQUENCE_SIMPLIFIED: ClassVar[str] = (
        "㐷㐹㐽㑇㑈㑔㑩㑺㓥㔉㖊㖞㘎㚯㛀㛟㛠㛣㛤㛿㝦㟆㟜㟥㡎㤖㤘㤭㤽㥪㦈㧏㧐㧑㧛㧟㧰㨫"
        "㭎㭏㭣㭤㭴㮠㱩㱮㲿㳔㳕㳠㳡㳢㳽㴋㶉㶶㶽㷪㺍㻅㻏㻘㻪㾡䀥䁖䂵䃅䅉䅟䅪䇚䇲䉤䌶䌷"
        "䌸䌹䌺䌻䌼䌽䌾䌿䍀䍁䎬䏝䐪䓓䓕䓖䓨䖼䗖䘛䘞䙊䙌䙓䛓䜣䜤䜥䜧䜩䝙䞌䞍䞎䞐䟢䢀䢁"
        "䢂䥺䥽䥾䥿䦀䦁䦂䦃䦅䦆䦶䦷䩄䭪䯃䯄䯅䲝䲞䲟䲠䲡䲢䲣䲤䴓䴔䴕䴖䴗䴘䴙䶮万与丑专"
        "业丛东丝丢两严丧个丰临为丽举么义乌乐乔习乡书买乱了争于亏云亚产亩亲亵亸亿仅仆"
        "从仑仓仪们价众优伙会伛伞伟传伡伣伤伥伦伧伪伫体余佣佥侠侣侥侦侧侨侩侪侬俣俦俨"
        "俩俪俫俭借债倾偬偻偾偿傥傧储傩儿克兑兖党兰关兴兹养兽冁内冈册写军农冬冯冲决况"
        "冻净准凉减凑凛几凤凫凭凯出击凿刍划刘则刚创删别刬刭刮制刹刽刾刿剀剂剐剑剥剧劝"
        "办务劢动励劲劳势勋勚匀匦匮区医千华协单卖卜卢卤卫却卷厂厅历厉压厌厍厐厕厘厢厣"
        "厦厨厩厮县叁参叆叇双发变叙叠只台叶号叹叽吁合同后向吓吕吗吣吨听启吴呐呒呓呕呖"
        "呗员呙呛呜咏咙咛咝咤咸响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢唤啧啬啭啮啯啰啴啸喷喽"
        "喾嗫嗳嘘嘤嘱噜嚣回团园困囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟坠垄垅垆垒垦垩垫"
        "垭垯垱垲垴埘埙埚埯堑堕塆墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥奨奸妆妇妈妩妪"
        "妫姗姜姹娄娅娆娇娈娱娲娴婳婴婵婶媪媭嫒嫔嫱嬷孙学孪宁宝实宠审宪宫家宽宾寝对寻"
        "导寿将尔尘尝尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岽岿峃峄峡峣峤峥峦崂崃"
        "崄崭嵘嵚嵝巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂干并广庄庆庐庑库应庙庞废庼廪开异"
        "弃弑张弥弪弯弹强归当录彝彟彦彨彻征径徕御忆忏志忧忾怀态怂怃怄怅怆怜总怼怿恋恒"
        "恳恶恸恹恺恻恼恽悦悫悬悭悮悯惊惧惨惩惫惬惭惮惯愠愤愦愿慑慭懑懒懔戆戋戏戗战戬"
        "戯户才扑执扩扪扫扬扰折抚抛抟抠抡抢护报担拟拢拣拥拦拧拨择挂挙挚挛挜挝挞挟挠挡"
        "挢挣挤挥挦挽捝捞损捡换捣据掳掴掷掸掺掼揽揾揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸"
        "撺擜擞攒敌敛敩数斋斓斗斩断旋无旧时旷旸昙昼昽显晋晒晓晔晕晖暂暅暧曲术朱朴机杀"
        "杂权杆条来杨杩杰松板极构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖栗样"
        "栾桠桡桢档桤桥桦桧桨桩桪梦梼梾梿检棁棂椁椝椟椠椢椤椫椭椮楼榄榅榇榈榉槚槛槟槠"
        "横樯樱橥橱橹橼檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵毶氇气氢氩氲汇汉汤汹沄沈"
        "沟没沣沤沥沦沧沨沩沪泞注泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒"
        "浓浔浕涂涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温湾湿溁溃溅溆溇滗滚滞"
        "滟滠满滢滤滥滦滨滩滪漓漤潆潇潋潍潜潴澛澜濑濒灏灭灯灵灶灾灿炀炉炜炝点炼炽烁烂"
        "烃烛烟烦烧烨烩烫烬热焕焖焘煴爱爷牍牦牵牺犊状犷犸犹狈狝狞独狭狮狯狰狱狲猃猎猕"
        "猡猪猫猬献獭玑玙玚玛玮环现玱玺珐珑珰珲琎琏琐琼瑶瑷瑸璎瓒瓯电画畅畴疖疗疟疠疡"
        "疬疭疮疯疱疴症痈痉痒痖痨痪痫瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫皑皱皲盏盐监盖盗盘眍眦眬着"
        "睁睐睑瞆瞒瞩矫矶矾矿砀码砖砗砚砜砺砻砾础硁硕硖硗硙硚确硵硷碍碛碜礼祃祎祢祯祷"
        "祸禀禄禅离秃秆秋种积称秽秾稆税稣稳穑穷窃窍窎窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑"
        "筚筛筜筝筹筼签简箓箦箧箨箩箪箫篑篓篮篯篱簖籁籴类籼粜粝粤粪粮糁糇系紧累絷纟纠"
        "纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绂练组绅细"
        "织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬"
        "续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒"
        "缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂网罗"
        "罚罢罴羁羟翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肮肴肾肿胀胁胆胜胡胧胨胪胫胶脉脍"
        "脏脐脑脓脔脚脱脶脸腊腘腭腻腼腽腾膑臜致舆舍舣舰舱舻艰艳艺节芈芗芜芦芸苁苇苈苋"
        "苌苍苎苏苧苹范茎茏茑茔茕茧荆荐荙荚荛荜荝荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅"
        "莱莲莳莴莶获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蒙蓝蓟蓠蓣蓥蓦蔂蔑蔷蔹蔺蔼蕰蕲蕴"
        "薮藓蘖虏虑虚虫虬虮虽虾虿蚀蚁蚂蚃蚕蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蝇蝈蝉蝼蝾螀螨蟏"
        "衅衔补表衬衮袄袅袆袜袭袯装裆裈裢裣裤裥褛褝褴襕见观觃规觅视觇览觉觊觋觌觍觎觏"
        "觐觑觞触觯訚詟誉誊讠计订讣认讥讦讧讨让讪讫讬训议讯记讱讲讳讴讵讶讷许讹论讻讼"
        "讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询"
        "诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈"
        "谉谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮"
        "谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸"
        "费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞"
        "赟赠赡赢赣赪赵赶趋趱趸跃跄跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫"
        "转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑"
        "辒输辔辕辖辗辘辙辚辞辟辩辫边辽达迁过迈运还这进远违连迟迩迳迹适选逊递逦逻遗遥"
        "邓邝邬邮邹邺邻郁郏郐郑郓郦郧郸酂酝酦酱酽酾酿采释里鉴銮錾钅钆钇针钉钊钋钌钍钎"
        "钏钐钑钒钓钔钕钖钗钘钙钚钛钜钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴"
        "钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铇铈铉铊铋铌铍铎铏铐铑铒铓铔铕铖铗铘铙铚"
        "铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销"
        "锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗锘错锚锛锜锝锞锟锠锡锢锣锤锥锦"
        "锧锨锩锪锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅镆镇镈镉镊镋镌"
        "镍镎镏镐镑镒镓镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲"
        "镳镴镵镶长门闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈"
        "阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陦陧陨险随隐隶隽"
        "难雏雠雳雾霁霉霡霭靓静面靥鞑鞒鞯韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂"
        "颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风"
        "飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饣饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹"
        "饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵"
        "驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛"
        "骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓鬶魇魉鱼鱽鱾鱿鲀鲁鲂鲃鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎"
        "鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴"
        "鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳚"
        "鳛鳜鳝鳞鳟鳠鳡鳢鳣鳤鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺"
        "鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹛鹜鹝鹞鹟鹠"
        "鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹮鹯鹰鹱鹲鹳鹴鹾麦麸麹黄黉黡黩黪黾鼋鼍鼗鼹齐齑齿龀"
        "龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟鿎鿏鿒鿔鿕"
    )
    # '龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟鿎鿏鿒鿔鿕鿟鿭鿰鿲鿴鿵鿶鿷鿸鿹鿺 E​2‍3‛2‛F”0'\
    # '‟9․2‥7⁫3⁬5⁬6⁯E₆0₲4₽F₾0⃃7⃅E⃊5⃍E⃒2⃗8⃗E℡B℩1ℬ0ℭ7℮4ℼ6ⅈ4ⅶ0ⅸBⅻ1ↁFↄ7↖7↵C↶C⇌3⇍2⇕D⇛4⇠3'\
    # '⇨3⇭8∁6∬8≌5≝3≡9≡D≡E≥0≥1≥2≥3≮F≿C⊝0⊩3⊩7⊬A⊭8⊭E⊮C⊰D⊲6⊴F⋚3⋷E⌌1⌙0⌢3⌧C⌶8⌶F⌷0⌹1⌾2⍁5⍂4'\
    # '⍅D⍇6⍈C⍉7⍏F⍗2⍜A⍜B⍡0⍡3⍣4⍣7⍣E⍦5⍩A⍸E⎣C⎶4⎾3⏅D⏉7⏉8⏌6⏚9⏚B⏢3⏫C⏫D⏷7⏸D␚1␚2␜3␜4␞D␟B␣6␣7'\
    # '␨0␬F␻A␻B⑦F⑳5⑶2⑸3⑺4⒀B⒘0⒧DⓌ4ⓘAⓚ7ⓧA⓬A⓶F⓸0⓿2┆2┕8┗4┚7┞2┹D╁F╂F╃0╃B╖4╺6╼2▜2▧A▰0▰8▱E'\
    # '▲0▴9▸B▹C▻E◅4◦5◨5◨7☠8☠9☠B☠C☠E☠F☡0☡1☡2☡3☡4☡5☡6☡7☡8☡9☡A☡B☡C☡D☡E☡F☢0☢1☶0♮8♷C♸C♽7'\
    # '⚢9⚱9⛃4⛐7⛭5✣4✣F✥0✥E✽6✽7❄F❊D❲1❲D❵D➒4➔5➺A⟍5⟥1⟥2⟥3⟥4⟥5⟥6⟥7⟪3⟼8⟽B⠀1⠃1⠇4⠋A⠐4⠕B⠖B⠖C'\
    # '⠥7⡀5⡀6⡀7⡀8⡀9⡀A⡇9⡵5⡿3⢂8⢅9⢇A⢋8⢓0⢞E⣃E⣃F⣄0⣄1⣄2⣄3⣄4⣄5⣄6⣄7⣄8⣄9⣄A⣄B⣄C⣄D⣄E⣄F⣅0⣅1⣅2⣅3'\
    # '⣅4⣅5⣅6⣟F⣠0⣠1⣠2⣠3⣠4⣠5⣠6⣠7⣠9⣠A⣠B⣠C⣠E⣡8⣡F⣯9⤿C⤿D⤿E⤿F⥀0⥙5⥙6⥙7⥦5⥦6⥦7⥦8⥦9⥦A⥦B⥦C⥦D⥦E'\
    # '⥦F⥧0⥿F⦀0⦀1⦀2⦀3⦀5⦀6⦀7⦀8⦀9⦀A⦀B⦀C⦀E⦀F⦂0⦅6⦅A⦞6⦞8⦞9⦞A⦞B⦞C⦞D⦞E⦞F⦟0⦟1⦟2⦟3⦟4⦟5⦟6⦟8⦟A'\
    # '⦟B⦟C⦟F⦠0⦠1⦠3⦠4⦠5⦠6⦠7⦠8⦠9⦠A⦠B⦠C⦠D⦠E⦠F⦡0⦤8⦲3⦲4⦳E⦷9⦽2⧃0⧉2⧐C⧷9⧷A⧷B⧷C⧷D⧷E⧷F⧸1⧸2⧸3'\
    # '⧸4⧸5⧸6⧸7⧸8⧸A⧸B⧸C⧸E⨤2⨤3⨤4⨤5⨤6⨤8⨤9⨤A⨤B⨤C⨤D⨤E⨤F⨥0⨥1⨥2⨥4⨥5⨸8⨸9⨸A⨸B⨸C⩄5⩒D⩨F⩩0⩭E⩰E'\
    # '⩳A⩹D⩼E⩽D⩿2⪀0⪀3⪀F⪁F⪂1⪃3⪃5⪃8⪃D⪄0⪄3⪄B⪄F⪅B⪅E⪇A⪈8⪈B⪈C⪉0⪉2⪉5⪊0⪊E⪌6⪍2⪏B⪐4⪐5⪑A⪖0⪖B⪗0'\
    # '⪗F⪜0⪝8⪠7⪠A⪡7⪢7⪢9⪣6⪣7⪣9⪤7⪤E⪥8⪥B⪧8⪩1⪩E⪫4⪬C⪮1⪯7⪯8⪯A⪱A⪲F⪵D⪶2⪶7⪶F⪷5⪷E⪸3⪸B⪹6⪻3⪻6⪼B'\
    # '⫃6⫆5⫇7⫈E⫉4⫉B⫊E⫌D⫑9⫒F⫔7⫕1⫖3⫗1⫘4⫙2⫚E⫝̸D⫟D⫡5⫢9⫤0⫦0⫧3⫧9⫪3⫪A⫪D⫫7⫫8⫫B⫫D⫭0⫮8⫯2⫯A⫰B⫳4'\
    # '⫴2⫵D⫶A⫶D⫶E⫷4⫷7⫹4⫺2⫺6⫻8⫼A⫽E⫾B⫿5⬀C⬁3⬂8⬂C⬂E⬄2⬅F⬆1⬇2⬇3⬇7⬇A⬈3⬈6⬈8⬉6⬋F⬍7⬑9⬑A⬑B⬑C⬑D'\
    # '⬑E⬑F⬒0⬒1⬒2⬒3⬒4⬒5⬒6⬒7⬒8⬒9⬒A⬒B⬒C⬒D⬒E⬒F⬓0⬓1⬓2⬓3⬓4⬓5⬓6⬓7⬓8⬓9⬔5⬕7⬖5⬖D⬗C⬘F⬙D⬚B⬝8⬞6'\
    # '⬞A⬞D⬟4⬟D⬠9⬠E⬡F⬣5⬤1⬤4⬪A⬪E⬫1⬫8⬫9⬫B⬬7⬬C⬯2⬯7⬯9⬯B⬰0⬰7⬰B⬲8⬲9⬲A⬲B⬲C⬲D⬲F⬴F⬵0⬵9⬵A⬵B⬵C'\
    # '⬵E⬵F⬶0⬶1⬶2⬶3⬶4⬶5⬶6⬶7⬶8⬶9⬶A⬶B⬶C⬶D⬶E⬶F⬷0⬷1⬷2⬷3⬷4⬷5⬷6⬷7⬷8⬷9⬷A⬷B⬷C⬷D⬷E⬷F⬸6⬸C⬺6⬺7'\
    # '⬺8⬺9⬺A⬺B⬺C⬺D⬻1⬻3⬻8⬻A⬼3⬼6⬼B⬼C⬽0⬽1⬽5⬽E⬾8⭀4⭀5⭀6⭀7⭀8⭀9⭀A⭀B⭀C⭀D⭀E⭀F⭁0⭁1⭁2⭁3⭁4⭁5⭁6'\
    # '⭁7⭁8⭁9⭃7⭅8⭆1⭇7⭎5⭎6⭎7⭎8⭎9⭎A⭎B⭎C⭎D⭎E⭎F⭏0⭏1⭏2⭏3⭏4⭏5⭏6⭏7⭏8⭏9⭏A⭏B⭏C⭏D⭏E⭏F⭐0⭐1⭐2⭐3'\
    # '⭐4⭐5⭐6⭐7⭐8⭐9⭐A⭐B⭐C⭐D⭐E⭐F⭑0⭑1⭑2⭑3⭑4⭑5⭑6⭒D⭒F⭓0⭓1⭓2⭓4⭓5⭓6⭓D⭕A⭖5⭖8⭘3⭘5⭘7⭙1⭙2⭙3⭙4'\
    # '⭙5⭙6⭚A⭚B⭚C⭚D⭚E⭚F⭛0⭛1⭛2⭛3⭛4⭛5⭛6⭛7⭛8⭛9⭛A⭜7⭜8⭜9⭜A⭜B⭝A⭝E⭝F⭞0⭞1⭞2⭞3⭞4⭞5⭞6⭞7⭞8⭞9⭞A'\
    # '⭞B⭞C⭞D⭞E⭞F⭟0⭟1⭟2⭟3⭟4⭟5⭡B⭡C⭡D⭡E⭡F⭢0⭢1⭢3⭢4⭢5⭢6⭢7⭢8⭢9⭢A⭢B⭢C⭢D⭢E⭢F⭣0⭣1⭣D⭤2⭨8⭨9⭨A'\
    # '⭨B⭨C⭨D⭨E⭨F⭩0⭩1⭩2⭩3⭩4⭩5⭩6⭩7⭩8⭩9⭩A⭩B⭩C⭩D⭩E⭩F⭪0⭪1⭪2⭪3⭪4⭪5⭪6⭪7⭪8⭪9⭪A⭪B⭪C⭪D⭭A⭭B⭭C'\
    # '⭭D⭭E⭭F⭮0⭮1⭮2⭮3⭮4⭮5⭮6⭮7⭮8⭮9⭮A⭮B⭮C⭮D⭮E⭮F⭯0⭯1⭯2⭯3⭯4⭯5⭯6⭯7⭯8⭯9⭯A⭯B⭯C⭯D⭯E⭰0⭰1⭰2⭰3'\
    # '⭰4⭰5⭰A⭱1⭱2⭱3⭱4⭱5⭱9⭱F⭲8⭲9⭲A⭲B⭲C⭲D⭲E⭲F⭳0⭳2⭳3⭳7⭴8⭴B⭶1⭶6⭶7⭶8⭶9⭶A⭶B⭶C⭶D⭶E⭷5⭸5⭹7⭹A'\
    # '⭹B⭹D⭺0⭺1⭺2⭺3⭺5⭺6⭺7⭺8⭺9⭻7⭼3⭼4⭼5⭼6⭼7⭽1⭽5⭽E⭽F⭾0⭾1⭾2⭾4⭾5⭾6⭾B⭾C⭿2⭿3⭿4⭿5⭿6⭿7⭿8⭿9⭿A'\
    # '⭿B⭿C⭿D⭿E⭿F⮀0⮀1⮀2⮀5⮀6⮀7⮀8⮀A⮀B⮀C⮀F⮁0⮁1⮁2⮁6⮁C⮆C⮇6⮉2⮉4⮉8⮉9⮉C⮉F⮊8⮊A⮊C⮊D⮋2⮋8⮋9⮋A⮌9'\
    # '⮌A⮍B⮎B⮓8⮓D⮔D⮕4⮗3⮗5⮗A⮗C⮗D⮘1⮘5⮘9⮘B⮘C⮚9⮛0⮛3⮜3⮞E⮞F⮟7⮟F⮠6⮥5⮥6⮥A⮥B⮦4⮦5⮦9⮦B⮦F⮧3⮧8⮧A'\
    # '⮨0⮨1⮨2⮨3⮨4⮨5⮩1⮩8⮩A⮪7⮪A⮫A⮫D⮬7⮬F⮮6⮯5⮯E⮱0⮱9⮱F⮵E⮵F⮶2⮶8⮶A⮶E⮶F⮷2⮷C⮸3⮸5⮹C⮽2⮾5⮿6⯀2⯀D'\
    # '⯁B⯂0⯂1⯂2⯂3⯂8⯃0⯃9⯅5⯇F⯉7⯋8⯌3⯓C⯗5⯗6⯗7⯗8⯗9⯘4⯘5⯘7⯘A⯙5⯛2⯜5⯜8⯜9⯜C⯝8⯞C⯞E⯟7⯟9⯟E⯢9⯦E⯧4'\
    # '⯧7⯧C⯧D⯨1⯨2⯨6⯨A⯨C⯩2⯩3⯩8⯪A⯪B⯫7⯫9⯬1⯬7⯱7⯱D⯲3⯲4⯲5⯲7⯲B⯲E⯳1⯳2⯳5⯳6⯳D⯳E⯴0⯴1⯴7⯴A⯴B⯵0⯵4'\
    # '⯵9⯶2⯶3⯶5⯶7⯶B⯶E⯷2⯷3⯸1⯸3⯸9⯸F⯻2⯻3⯼2⯽7Ⰲ5Ⰲ9ⰂAⰂEⰃ1Ⰵ1Ⰵ8Ⰷ3Ⰷ5Ⰷ8ⰇAⰇDⰈ0Ⰸ2Ⰸ5Ⰸ9Ⰺ0Ⰺ9ⰊEⰋ0Ⰻ1'\
    # 'ⰋBⰌ0ⰌAⰌFⰍ8ⰍBⰎ6ⰎBⰎEⰏ2Ⰿ3ⰑEⰒ9ⰒCⰖ2Ⱆ5ⰖBⰘ2Ⱉ9Ⱊ6ⰚEⰛEⰜ3Ⱌ4Ⱌ7Ⱍ5Ⱍ8Ⱍ9ⰞCⰟ0Ⱏ9ⰟCⰠ1ⰠFⰡ5Ⱒ7Ⱓ1ⰣE'\
    # 'Ⱔ2Ⱔ7ⰤBⰦ0ⰧCⰨ2Ⱘ8Ⱘ9ⰨDⰨEⰩ6Ⱙ7ⰩCⰪ4Ⱚ6Ⱛ5Ⱛ6ⰫAⰫEⰬ3ⰬDⰱDⰲ0ⰲEⰳ4ⰳ5ⰳ7ⰵ9ⰵBⰶ1ⰶ4ⰸ6ⰹ1ⰺ7ⰺCⰽCⰽFⰾ4'\
    # 'ⰾ6ⰾBⰾEⰿ7ⱂ0ⱄ6ⱄ7ⱄDⱄFⱅ2ⱅ3ⱅ5ⱅ7ⱅ9ⱆ7ⱈ4ⱈ6ⱈ7ⱈ8ⱈAⱈDⱈEⱉ3ⱉ5ⱉ7ⱎ0ⱎBⱏ1ⱏ8ⱏCⱒFⱓ9ⱔ2ⱔ4ⱔAⱕBⱖ6ⱖC'\
    # 'ⱘ3ⱙ1ⱙ6ⱙ8ⱙEⱙFⱚ0ⱚEⱛAⱡ3ⱡ4ⱡ5ⱡ6ⱡ7ⱡ8ⱡ9ⱡAⱡBⱡCⱡDⱡEⱡFⱢ0Ɫ1Ɫ2Ɫ3Ɫ4Ɫ5Ɫ6Ɫ7Ɫ8Ɫ9ⱢAⱢBⱢCⱢDⱢEⱢF'\
    # 'Ᵽ0Ᵽ1Ᵽ2Ᵽ3Ᵽ4Ᵽ5Ᵽ6Ᵽ7Ᵽ8Ᵽ9ⱣAⱣBⱣCⱣDⱣEⱣFⱤ0Ɽ1Ɽ2Ɽ3Ɽ4Ɽ5Ɽ6Ɽ7Ɽ8Ɽ9ⱤAⱤBⱤEⱤFⱥDⱦAⱦBⱦDⱨ4Ɐ9ⱯCⱱ4'\
    # 'Ⱳ5Ⱳ7Ⱳ8ⱲCⱲFⱳ8ⱳAⱳEⱳFⱴ1ⱴ3ⱴAⱴBⱵ6ⱶ0ⱶFⱷ4ⱸBⱹ5ⱹ8ⱹFⱺ3ⱺBⱼ1ⱾAⱿAⱿDⲀ3Ⲁ5Ⲁ8Ⲃ0ⲃ1ⲃ7Ⲅ7ⲄDⲄEⲅ2ⲅ3'\
    # 'ⲅ4ⲅ5Ⲇ0Ⲇ6ⲇ1ⲇ7ⲇBⲈ7Ⲉ8Ⲉ9ⲈAⲈBⲈCⲈDⲈEⲈFⲉ0ⲉ1ⲉ2ⲉ3ⲉ4ⲉ5ⲊAⲊFⲋ3Ⲍ0ⲍ9ⲍAⲍBⲍCⲍDⲍEⲍFⲎ0Ⲏ1Ⲏ2Ⲏ3Ⲏ4'\
    # 'Ⲏ5Ⲏ6Ⲏ7Ⲏ8Ⲏ9ⲎAⲎBⲎCⲎDⲎEⲎFⲏ0ⲏ1ⲏ2ⲏ3ⲏ4ⲏ5ⲏ6ⲏ7ⲏ8ⲏ9ⲏAⲏBⲏCⲏDⲏEⲏFⲐ0Ⲑ1Ⲑ2Ⲑ3Ⲑ4Ⲑ5Ⲑ6Ⲑ7Ⲑ8Ⲑ9ⲐA'\
    # 'ⲐBⲐCⲐDⲐEⲐFⲑ0ⲑ1ⲑ2ⲑ3ⲑ4ⲑ5ⲑ6ⲑ7ⲑ8ⲑ9ⲑAⲑBⲑCⲑDⲑEⲑFⲒ0Ⲓ1Ⲓ2Ⲓ3Ⲓ4Ⲓ5Ⲓ6Ⲓ7Ⲓ8Ⲓ9ⲒAⲒBⲒCⲒDⲒEⲒFⲓ0'\
    # 'ⲓ1ⲓ7Ⲕ4Ⲕ8ⲗ3ⲗ4ⲗ5ⲗ6ⲗ7ⲗ8ⲗ9ⲗAⲗBⲗCⲗDⲗEⲗFⲘ0Ⲙ5Ⲙ6Ⲛ3Ⲛ5Ⲛ7Ⲛ9ⲚBⲚFⲛ4ⲛ5ⲛ9ⲛBⲛEⲜ0Ⲝ3ⲝ1ⲝ4ⲝAⲝBⲞ2'\
    # 'Ⲟ4Ⲟ9Ⲡ1Ⲡ2Ⲡ3Ⲡ4Ⲡ5Ⲡ6Ⲡ7Ⲡ8Ⲡ9ⲠBⲠCⲠDⲠEⲠFⲡ0ⲡ1ⲡ2ⲡ3ⲡ4ⲤEⲧDⲧEⲨDⲪ7Ⲫ8Ⲫ9ⲪBⲪFⲫAⲰ7Ⲳ7Ⲳ8Ⲳ9ⲲAⲲBⲲC'\
    # 'ⲲDⲲEⲲFⲳ0ⲳ1ⲳ2ⲳ3ⲳ4ⲳ5ⲳ6ⲳ7ⲳ8ⲳ9ⲳAⲳBⲳCⲳDⲳEⲳFⲴ0Ⲵ1Ⲵ2Ⲵ3Ⲵ5Ⲵ6Ⲵ7Ⲵ8Ⲵ9ⲴAⲴBⲴCⲴDⲴEⲴFⲵ0ⲵ1ⲵ3ⲵ4'\
    # 'ⲵ5ⲵ6ⲵ7ⲵ8ⲵ9ⲵAⲵBⲵCⲵDⲵEⲵFⲶ0Ⲷ1Ⲷ2Ⲷ3Ⲷ4Ⲷ5Ⲷ6Ⲷ8Ⲷ9ⲶAⲶBⲶCⲶDⲶFⲷ0ⲷ1ⲷ2ⲷ3ⲷ4ⲷ5ⲷ6ⲷ7ⲷ8ⲷ9ⲷAⲷBⲷC'\
    # 'ⲷDⲷEⲷFⲸ0Ⲹ1Ⲹ2Ⲹ3Ⲹ4ⲹ8ⲹ9ⲹCⲹDⲹFⲺ0Ⲻ1Ⲻ2Ⲻ3Ⲻ4Ⲻ5Ⲻ7Ⲻ8Ⲻ9ⲺAⲺCⲺDⲺEⲺFⲻ0ⲻ1ⲻ2ⲻ3ⲻ4ⲻ5ⲻ8ⲻ9ⲻAⲻBⲻF'\
    # 'Ⲽ0Ⲽ5ⲼAⲼEⳂ1Ⳃ3Ⳃ4Ⳃ5ⳃ1ⳃ2ⳃ3ⳃ4ⳃ5ⳃ6ⳃ7ⳃ8ⳃAⳅ3ⳅ4ⳅ5ⳅ6ⳅ7ⳅ8ⳅ9ⳅAⳅBⳅCⳅDⳅEⳅFⳆ0Ⳇ1Ⳇ2Ⳇ3Ⳇ4Ⳇ5Ⳇ6Ⳇ7'\
    # 'Ⳇ8Ⳇ9ⳆAⳆBⳆCⳆDⳆEⳆFⳇ0ⳇ1ⳇ2ⳇ3ⳇ5ⳇ7ⳇ8ⳇAⳇCⳇDⳇEⳇFⳈ0Ⳉ5Ⳉ6ⳉ5Ⳋ5Ⳋ6Ⳋ7Ⳋ8Ⳋ9ⳊAⳊBⳊCⳊDⳊEⳊFⳋ0ⳋ1ⳋ2'\
    # 'ⳋ3ⳋ4ⳋ5ⳋ6ⳋ7ⳋ8ⳋ9ⳋAⳋBⳋCⳋDⳋEⳋFⳌ0Ⳍ1Ⳍ2Ⳍ3Ⳍ4Ⳍ5Ⳍ6Ⳍ7Ⳍ8Ⳍ9ⳌAⳌBⳌCⳌDⳌEⳍ0ⳍ1ⳍ2ⳍ3ⳍ4ⳍ9ⳍFⳏ3ⳏ4ⳏ5'\
    # 'ⳏ6ⳏ7ⳏ8ⳏ9ⳏAⳏBⳏCⳏDⳏEⳏFⳐ0Ⳑ1Ⳑ2Ⳑ3Ⳑ4Ⳑ5Ⳑ6Ⳑ7Ⳑ8Ⳑ9ⳐAⳐBⳐCⳐDⳐEⳐFⳑ0Ⳓ8Ⳓ9Ⳙ0Ⳙ1Ⳙ2Ⳙ3Ⳙ4Ⳙ5Ⳙ6Ⳙ7Ⳙ8'\
    # 'Ⳙ9ⳘAⳘBⳘCⳘDⳘEⳘFⳙ0ⳙ1ⳙ2ⳙ3ⳙ4ⳙ5ⳙ6ⳙ7ⳙ9ⳙAⳙBⳙCⳙDⳙEⳙFⳚ0Ⳛ1Ⳛ2Ⳛ3Ⳛ4Ⳛ5Ⳛ6Ⳛ7Ⳛ8Ⳛ9ⳚAⳚBⳚCⳚDⳚEⳚF'\
    # 'ⳛ0ⳛ1ⳛ2ⳛ3ⳛ4ⳛ5ⳛ6ⳛ7ⳛ8ⳛ9ⳛAⳛBⳝ5ⳟBⳟCⳟDⳟEⳟFⳠ0Ⳡ1Ⳡ2Ⳡ3Ⳡ4Ⳡ5Ⳡ6Ⳡ8Ⳡ9ⳠAⳠBⳠCⳠDⳠEⳠFⳡ0ⳡ1ⳡ2ⳡ3ⳡ4'\
    # 'ⳡ5ⳡ6ⳡ7ⳡ8ⳡ9ⳡAⳡBⳡCⳡDⳡEⳡFⳢ0Ⳣ1Ⳣ2Ⳣ3Ⳣ4Ⳣ5Ⳣ6Ⳣ7Ⳣ8Ⳣ9ⳢAⳢBⳢCⳢDⳢEⳢFⳣ0ⳣ1ⳣ5ⳣ6ⳣ7ⳣ8ⳣ9ⳣEⳤ5ⳤ6ⳤ7'\
    # 'ⳤ8ⳤ9ⳤAⳤBⳤCⳤDⳤE⳥5⳥6⳥7⳥8⳦3⳦4⳦D⳧A⳧B⳧C⳧D⳧E⳧F⳨0⳨1⳨2⳨3⳨4⳨5⳨6⳨7⳨8⳨9⳨A⳨B⳨C⳨D⳨E⳨F⳩0⳩1'\
    # '⳩2⳩3⳩4⳩5⳩6⳩B⳩C⳩D⳩FⳮE⳹6⳺3ⴑBⴜ0ⴜ9ⴝ9ⴝCⴞ1ⴞFⴟ4ⴠ8ⴠ9ⴡCⴡFⴢEⴥ7⴦8ⴧC⴫8ⴸ2ⴹCⴾ6ⴿ8ⵇ8ⵇ9ⵌ0ⵔ6ⵡ3'\
    # 'ⵡA⵪6⵴B⵶B⵸4ⶁ9ⶃDⶄ6ⶅCⶇ5ⶈBⶉ5ⶉDⶌ7ⶎ7ⶐEⶓ0ⶕ3⶜BⶥAⶥB⶧0ⶨ6ⶬ0ⶭ9ⶭDⶴ8ⷀEⷁ2ⷁ7ⷂ5ⷄ0ⷄAⷊBⷐAⷓ3ⷥCⷬD'\
    # 'ⷭ4⸂1⸂4⸂A⸃2⸔E⸘F⸝4⸞4⸦0⸦1⸦2⸦3⸦4⸦5⸦7⸦8⸦9⸦A⸦B⸦C⸦D⸦E⸦F⸰C⸸D⸼0⸿A⹁A⹂8⹐2⹐5⹐A⹘1⹘3⹛1⹤A⹤B'\
    # '⹭7⹳6⹷4⹷5⹷7⹷8⹷9⹷A⺁E⺃3⺏2⺏3⺏4⺏5⺏6⺒B⺒C⺒D⺒E⺒F⺓2⺓3⺓6⺓7⺓8⺘5⺙A⺟4⺟5⺣4⺣5⺥B⺥C⺥D⺥E⺪1⺪2⺪3'\
    # '⺪4⺪5⺬2⺱B⺱C⺱D⺱E⺱F⺲0⺲1⺲2⺲3⺲4⺶1⺶2⺶4⺶5⺶6⺶8⺶A⺷0⺸5⺸7⺽9。1。2〄8々C〆7〇8〇E〈1〈3〈B〈E〈F〉7〉C'\
    # '《6《D》B「6『E』3』6』7』B』F【1】E〒D〕4〖5〖6〗B〙5〙9〙A〜0〜A〜E〝5〝6〝8〞0〞1〞3〞5〟2〟C〠6〠7〠A〠D〡3〢E'\
    # '〢F〣6〤1〤4〥8〥9〥A〦3〦5〦9〦A〧1〧D〨2〨5〨8〩1〩B〩F〪1〪2〭6〯8〯9〯D〯E〰0〰2〰6〰7〰9〱9〲6〳7〸C〸E〸F〹0'\
    # '〹1〹4〹6〹B〹D〹E〺0〺2〺6〺B〻4〻7〻9〼1〽3〽5〽C〽F〿2〿6〿C〿DぁAぃEい1い4い5ぅ4ぅ5ぅ9ぅFう5う7うAうBうCぇ5ぇ8'\
    # 'ぇFえ6ぉ2ぉ6が4が6き4き5き7き9きCきDきFぎ4ぎ7ぎCく1く7くBくCぐ7ぐBこ2こ6ご1ご5ご8さ0ざDじ8じFすAず0ず9ぜ5ぜ6そ3そ6'\
    # 'そ8そ9そAそBそCぞ1ぞ2ぞ6ぞ8ぞCた5た9たAだ0だ5だ8ち3ぢ0ぢ3ぢ9っ3っ6っ8つBつEづ1づ5とDど4な6なAなCに1ぬ9ぬAぬFね2ねB'\
    # 'の1の3の4の5の6の8の9のAのEは1は2は5はAはBはDぱ0ぱCぱDひ2ひ8び3ぴ5ぴBぴDふ7ふCふEふFぶ4ぷEへ7へ9へDぺ4ほ2ほ3ほ7ほB'\
    # 'ぼ4ぽ8めBもBゃ2ゃ4ゃ9や4や9やAやBやEやFゅ0ゅ4ゅEゆ2ゆ9ょ0ょ5ょBょDよ4り2り4り6ゎ2ゎ6ゎ9ゎBゎCゎFわ6わCわDゑ3ゑ5を8'\
    # 'をBをCんDゔAゕ2ゕBゕEゖ0ゖ2ゖ3ゖ8ゖAゖD゗9゙4゙C゚6゚8゚D゛0゛4゛7゛E゛F゜3゜7゜8゜9゜Eゝ4ゝ8ゟ0ゟBゟEァ6ァCア6ィ3'\
    # 'イ5イFゥ3ウ7ウEェ2ェ8ェ9ェAェBエAエFオ3オAオBオDカ6カCカFガBキ6クCクDクFグ0グ1グ2グ3グ5グ6グ7グ8グ9グBグCグDグEグF'\
    # 'ケ0ケ1ケ2ケ3ケ4ケ6ケ7ケ8ケ9ケAケBケCケDケEケFゲ0ゲ1ゲ2ゲ3ゲ4ゲ5ゲ6ゲ7ゲ8ゲ9ゲAゲBゲCゲDゲEゲFコ0コ1コ2コ3コ4コ5コ6'\
    # 'コ7コ8コ9コAコBコCコDコEコFゴ0ゴ1ゴ4サ4サ7サAザ2ザ3シ9ジ5ジ7ス9スDズDセ2ゼ2ゼBゼEダ6ダBダCダFチ1ヂ0ヂ2ヂ4ヂ8ヂEッ1'\
    # 'ッ3ッ4ッ5ッ6ッ7ッ9ッAッEッFツ0ツ7ツ8ツ9ツAツCツDヅ0ヅ1ヅBヅDヅFテ6テ9テEテFデ1デ2デEト1ト2ド2ド6ドFナ0ナBナCナEナF'\
    # 'ニ0ニ2ニ3ニ4ニ5ニ6ニ8ニ9ニAニBヌ1ヌ2ヌ4ヌ6ヌAネ7ネAハ2ハ5ハ8ハ9ハAハBハCバ2パ5パ6パ7パ8パ9パAパBパCパDパEヒ2ヒ3ヒ4'\
    # 'ヒ5ヒFピAピCピDピEピFフ0フ1フ2フ3フ4フ6フ7フ8フ9フAフBフCフDフEブ0ブ1ブ2ブ3ブ4ブ5ブ6ブ7ブ8ブ9ブAブBブCブDブEブFプ0'\
    # 'プ1プ2プ3プ4プ5プ6プ7プ8プ9プAプBプCプDプEプFヘ0ヘ1ヘ2ヘ3ヘ4ヘ5ヘ6ヘ7ヘ8ヘ9ヘAヘBヘCヘDヘEヘFベ1ベ4ペ8ペCポEマ0マ1'\
    # 'マ2マ4マ5マ6マ7マ8マ9マAマBマCマDマEミ4ミ5ミ6ミ8ム7ム8ムAムEメ0メ4メAメBメEモ6ヤ0ユFョ1ョ2ョ3ョ4ョ5ョ6ョ7ョ8ョAョB'\
    # 'ョCョDョEョFヨ0ヨ1ヨ2ヨ3ヨ4ヨ5ヨ6ヨ7ヨ8ヨ9ヨAヨBヨCヨDヨEヨFラ0ラ1ラ2ラ3ラ4ラ5ラ6ラ7ラ8ラ9ラAラBラCラDラEラFリ0リ1'\
    # 'リ2リ3リ4リ8リDル2ル7レ6ロDヮ1ヮ6ヮ8ヮEワ3ヰ5ヰBヰFヱ1ンBヵ5ヵ6ヵ7ヵ8ヵAヵBヵCヵDヵEヶ0ヶ1ヶ2ヶ3ヶ5ヶ6ヶ7ヶ8ヶ9ヶB'\
    # 'ヶCヶDヶEヶFヷ0ヷ1ヷ2ヷ3ヷ4ヷ5ヷ6ヷ7ヷ8ヷ9ヷAヷBヷCヷDヷEヷFヸ0ヸ1ヸ3ヸ4ヸ5ヸ6ヸ7ヸ8ヸ9ヸAヸBヸCヸDヸEヸFヹ0ヹ1ヹ2'\
    # 'ヹ3ヹ5ヹ6ヹ7ヹ8ヹ9ヹAヹBヹCヹDヹEヹFヺ1ヺ2ヺ3ヺ4ヺ5ヺ6ヺ7ヺ8ヺ9ヺAヺBヺCヺDヺEヺF・0・1・2・3・4・5・6・7・8・9・A'\
    # '・B・C・D・E・Fー0ー1ー2ー3ー4ー5ー6ー7ー8ー9ーAヽ6ヾ5ヾ6ヾ7ヾ8ヾ9ヾAヾBヾCヾDヾFヿ0ヿ3ヿ4ヿ5ヿ8ヿ9ヿAヿBヿE㄁1㄂1'\
    # 'ㄅ2ㄅEㄇ1ㄇ3ㄇ4ㄇ6ㄇ7ㄇ9ㄇAㄇDㄇEㄈ3ㄈ4ㄈ5ㄈ6ㄈ7ㄈ8ㄈ9ㄈAㄈBㄈCㄈDㄈEㄉ0ㄊ0ㄊ1ㄊ2ㄊ3ㄊ4ㄊ5ㄊ6ㄊ7ㄊ8ㄊ9ㄊBㄊCㄊDㄊE'\
    # 'ㄊFㄋ0ㄋ1ㄋ2ㄋ3ㄋ4ㄋ5ㄋ6ㄋ7ㄋ8ㄋAㄋBㄍ4ㄍ5ㄍ6ㄍ7ㄍ8ㄍ9ㄍAㄍBㄍCㄍDㄍEㄍFㄎ0ㄏ1ㄏ2ㄏ3ㄏ4ㄏ5ㄏ7ㄏ8ㄏ9ㄏAㄏCㄏDㄏEㄏF'\
    # 'ㄐ0ㄐ1ㄐ2ㄐ3ㄐ4ㄐ5ㄐ6ㄐ7ㄐ8ㄐ9ㄐAㄓCㄓDㄓEㄓFㄔ0ㄔ1ㄔ2ㄔ3ㄔ4ㄔ5ㄔ7ㄔ8ㄔ9ㄔAㄔBㄔDㄔEㄔFㄕ0ㄕ2ㄕ3ㄕ4ㄕ5ㄕ6ㄕ7ㄕ8ㄕ9'\
    # 'ㄕAㄕBㄕCㄕDㄕEㄕFㄖ0ㄖ1ㄖ2ㄖ3ㄖ4ㄖ5ㄖ6ㄖ7ㄖ8ㄖ9ㄖAㄖBㄖCㄖEㄘ0ㄘ1ㄘ3ㄘ4ㄘ5ㄘ6ㄘ8ㄘCㄘDㄙ6ㄙ9ㄙAㄙBㄜDㄜEㄜFㄝ0ㄝ1'\
    # 'ㄝ2ㄝ3ㄝ4ㄝ5ㄝ6ㄝ7ㄝ8ㄝ9ㄝAㄝBㄝCㄝDㄝEㄝFㄞ0ㄞ1ㄞ2ㄞ3ㄞ4ㄞ5ㄞ6ㄞ7ㄞ8ㄞ9ㄞAㄞBㄞCㄞDㄞEㄞFㄟ0ㄟ1ㄟ2ㄟ3ㄟ4ㄟ5ㄟ6ㄟ7'\
    # 'ㄟ8ㄟ9ㄟAㄟBㄟCㄟDㄟEㄟFㄠ0ㄠ1ㄠ2ㄠ3ㄠ4ㄠ5ㄠ6ㄠ7ㄠ8ㄠ9ㄠAㄠBㄠCㄠDㄠEㄠFㄡ0ㄡ1ㄡ2ㄡ3ㄡ4ㄡ5ㄡ6ㄡ7ㄡ8ㄡ9ㄡAㄡBㄡCㄤ7'\
    # 'ㄤ8ㄤ9ㄤAㄤBㄤCㄤDㄤEㄤFㄥ0ㄥ1ㄥ2ㄥ3ㄥ4ㄥ5ㄥ6ㄥ7ㄥ8ㄥ9ㄥAㄥBㄥCㄥDㄥEㄥFㄦ0ㄦ1ㄦ2ㄦ3ㄦ4ㄦ5ㄦ6ㄦ7ㄦ8ㄦ9ㄦAㄦBㄦCㄦD'\
    # 'ㄦEㄦFㄧ0ㄧ1ㄧ2ㄧ3ㄧ4ㄧ5ㄧ6ㄧ7ㄧ8ㄧ9ㄧAㄧBㄧCㄧDㄧEㄧFㄨ0ㄨ1ㄨ2ㄨ3ㄨ4ㄨ5ㄨ6ㄨ7ㄨ8ㄨ9ㄨAㄨBㄨCㄨDㄨEㄨFㄩ0ㄩ1ㄩ2ㄩ3'\
    # 'ㄩ4ㄩ5ㄩ6ㄩ7ㄩ8ㄩ9ㄩAㄩBㄩCㄩDㄩEㄩFㄪ0ㄪ1ㄪ2ㄪ3ㄪ4ㄪ5ㄪ6ㄪ7ㄪ8ㄪ9ㄪAㄪBㄪCㄪDㄪEㄪFㄫ0ㄫ1ㄫ2ㄫ3ㄫ4ㄫ5ㄫAㄫBㄫCㄫD'\
    # 'ㄬ2ㄬ4ㄬ5ㄬ6ㄬ7ㄬ8ㄬ9ㄬAㄬBㄬCㄬDㄬEㄭ0ㄭ1ㄭ3ㄭ4ㄭ5ㄭ6ㄭ7ㄭ8ㄭ9ㄭAㄭCㄭDㄭFㄮ0ㄮ1ㄮ2ㄮ3ㄮ4ㄮ5ㄮ6ㄮ8ㄮAㄮBㄮCㄮDㄮE'\
    # 'ㄯ1ㄯ4ㄯ6ㄯEㄯF㄰0㄰1㄰3㄰4㄰5㄰6㄰7㄰8㄰9㄰A㄰Fㄱ5ㄱ6ㄱ7ㄱ8ㄱ9ㄲBㄲCㄲDㄲEㄲFㄳ0ㄳ1ㄳ2ㄳ3ㄳ4ㄳ5ㄳ6ㄳ7ㄳ8ㄳ9ㄳAㄳC'\
    # 'ㄳDㄴ1ㄴ2ㄴ4ㄴ5ㄴ6ㄴ7ㄴ8ㄴ9'
    __p_zh_s: ClassVar[regex.Pattern[str]] = regex.compile(
        rf"(?![{__JAPANESE_KANJIS_SEQUENCE_1ST}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_2ND_JOYO}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_3RD_JOYO}])"
        + rf"(?=[{__CHINESE_KANJIS_SEQUENCE_SIMPLIFIED}])"
    )
    #
    __CHINESE_KANJIS_SEQUENCE_TRADITIONAL: ClassVar[str] = (
        "㑮㑯㑳㑶㒓㒜㒣㒿㓄㓖㓨㔃㔅㔋㔝㔢㕒㕢㖦㖮㗙㗢㗣㗰㗲㗶㗻㗼㗿㘓㘔㘖㘙㘚㘤㙔㙡㙢"
        "㙬㙺㙾㛝㜄㜏㜐㜗㜞㜢㜥㜭㜮㜷㜺㝞㝟㞞㟺㠁㠏㠠㠣㡓㡞㢗㢝㤲㥮㥷㦊㦎㦖㦛㦞㦦㦬㦭"
        "㨛㨟㨥㨻㩇㩋㩌㩜㩣㩭㩳㩵㩷㩹㪎㪹㬣㬮㮓㮝㮲㯂㯆㯤㯸㯼㰂㰅㰍㰰㰳㲯㲰㲲㴸㴿㵍㵑"
        "㵒㵗㵤㵾㶆㶌㶍㶏㶒㶕㷃㷍㷲㷶㷻㷿㸅㸊㸐㹓㹽㺏㺑㺜㻶㻽㼆㼈㼻㾵㾺㿉㿎㿖㿗㿧㿹䀉"
        "䀍䀴䀹䁝䁪䁱䁻䂎䂓䃁䃕䃘䃢䃣䃤䃮䃴䅐䅘䅳䆅䆉䇓䉍䉐䉑䉙䉬䉱䉲䉶䊜䊟䊭䊲䊵䊷䊺"
        "䋃䋆䋍䋎䋏䋐䋑䋔䋙䋚䋦䋫䋹䋺䋻䋼䋽䋾䋿䌁䌇䌈䌋䌌䌐䌖䌝䌞䌟䌥䌪䌰䍤䍷䍽䎘䎙䎱"
        "䏊䐢䐣䐷䐹䐽䑗䑼䓣䔇䔈䔡䕡䕤䕳䕹䕼䖀䖅䖚䗃䗅䗥䗻䗽䗿䙔䙡䙱䙼䚆䚉䚕䚞䚩䚳䚵䚽"
        "䛀䛄䛌䛍䛘䛛䛞䛠䛤䛬䛭䛳䛽䛿䜀䜄䜉䜋䜍䜎䜏䜒䜖䜚䜝䝏䝕䝭䝯䝻䝼䞀䞁䞂䞈䞉䞋䞓"
        "䞶䟃䟆䟏䟐䟺䠆䠟䠠䠩䠮䠱䡁䡅䡇䡊䡐䡗䡘䡝䡟䡦䡩䡰䡴䡵䡶䡷䡻䡾䢈䢨䤌䤍䤠䤤䤥䤨"
        "䤩䤪䤬䤵䤸䤻䤼䥄䥇䥑䥕䥖䥗䥛䥝䥞䥩䥯䥱䥴䥶䥷䥸䦌䦎䦘䦛䦝䦟䦪䦯䦱䦳䧞䧢䨴䩫䪊"
        "䪍䪏䪐䪓䪗䪘䪜䪝䪥䪴䪼䪾䫀䫂䫈䫉䫌䫏䫐䫜䫟䫠䫥䫩䫴䫶䫻䫼䫾䬀䬂䬅䬍䬎䬐䬓䬔䬘"
        "䬝䬞䬟䬣䬧䬪䬫䬬䬯䬲䬳䬶䬹䬾䭀䭃䭅䭇䭈䭉䭑䭒䭓䭔䭕䭘䭞䭡䭢䭣䭭䭿䮂䮄䮈䮗䮝䮞"
        "䮠䮧䮫䮰䮲䮳䮸䮽䮾䮿䯀䯤䰎䰐䰖䰫䰲䰷䰻䰽䰾䱀䱁䱂䱅䱇䱌䱍䱎䱐䱒䱓䱗䱙䱚䱛䱜䱟"
        "䱡䱤䱥䱧䱬䱭䱰䱱䱴䱵䱷䱸䱹䱻䱽䱾䲁䲅䲉䲏䲕䲖䲗䲘䲙䲚䲛䲨䲰䲸䲹䲼䳅䳇䳍䳏䳒䳓"
        "䳕䳚䳜䳟䳢䳤䳧䳨䳫䳭䳮䳲䳺䴇䴈䴉䴋䴚䴝䴬䴭䴮䴱䴲䴳䴴䴵䴷䴸䴹䴺䴽䵂䵃䵆䵐䵘䵳"
        "䵴䵶䵷䶕䶗䶢䶣䶦䶧䶨䶪䶱䶲丟並乾亂亞佇併來侖侶俁係俓俔俠俥倀倆倈倉個們倫倲偉"
        "偑偩側偵偽傌傑傖傘備傢傪傭傯傱傳傴債傷傾僀僂僅僆僉働僑僓僕僗僞僤僥僨僩僴價僾"
        "儀儁儂億儅儈儉儐儔儕儖儘償儢儣儥儩優儰儱儲儷儸儹儺儻儼兌兒兗內兩冊冪凈凍凔凙"
        "凜凟凱別刪剄則剋剎剗剛剝剮剴創剸剾劃劇劉劊劌劍劏劑劗劚勁勑動務勛勝勞勢勣勩勱"
        "勴勵勸勻匭匯匰匱匵區協卨卻厙厭厱厲厴參叄叢吒吳吶呂咼員哯唄唊唓唚唻問啞啟啢喎"
        "喚喪喬單喲嗆嗇嗊嗎嗚嗧嗩嗶嗹嗿嘄嘆嘇嘍嘓嘔嘖嘗嘜嘩嘪嘮嘯嘰嘳嘵嘸嘺嘽噁噅噓噚"
        "噝噞噠噥噦噯噲噴噸噹嚀嚂嚇嚈嚌嚍嚐嚕嚙嚛嚝嚠嚦嚧嚨嚩嚪嚫嚬嚱嚲嚳嚴嚶嚸嚽嚿囀"
        "囁囂囃囅囇囈囉囋囐囑囒囕囪圇國圍園圓圖團圞垵垷埉埡埨埬埰執堅堈堊堖堚堝堯報場"
        "塊塋塏塒塗塢塤塵塸塹塼塿墆墊墋墏墜墝墠墢墧墮墳墶墷墾墿壇壈壋壍壏壐壒壓壔壗壘"
        "壙壚壛壝壞壟壠壢壣壧壩壪壯壺壼壽夠夢夥夾奐奧奩奪奫奬奮奯奲奼妝姍姦娙娛婁婡婦"
        "婭婸媁媈媜媧媯媰媼媽嫈嫗嫢嫥嫧嫵嫻嫿嬃嬅嬇嬈嬋嬌嬐嬒嬙嬡嬣嬤嬦嬪嬮嬰嬸嬻嬾孄"
        "孆孇孋孌孎孫孲學孻孾孿宮寠寢實寧審寪寫寬寯寵寶寷將專尋對導尵尷屆屍屓屜屢層屨"
        "屩屬岡峴島峽崍崗崙崠崢崬崱崵嵐嵷嵸嵼嵽嵾嶁嶄嶇嶈嶔嶗嶠嶢嶤嶧嶨嶩嶪嶮嶴嶸嶹嶺"
        "嶼嶽巃巆巊巋巑巒巔巖巗巘巚巠巰帥師帳帴帶幀幃幓幗幘幟幠幣幩幫幬幰幱幹幺幾庫庲"
        "廁廂廄廈廎廔廕廗廚廝廞廟廠廡廢廣廥廧廩廬廮廳弒弳張強彄彈彌彍彎彙彞彠彥彲後徑"
        "從徠復徵徹徿恆恥悅悏悞悵悶惀惡惱惲惻愇愛愜愨愩愴愷愾慄態慍慐慘慙慚慟慣慪慫慮"
        "慯慱慲慳慶慸慹慺憂憊憍憐憑憒憖憚憢憤憦憪憫憮憲憴憶憸憹懀懇應懌懍懓懕懘懙懜懞"
        "懟懠懣懤懧懨懩懫懭懰懲懶懷懸懺懼懾戀戁戃戇戔戠戧戩戰戱戲戶拋挩挾捨捫捲掁掃掄"
        "掆掗掙掚掛採揀揚換揮搊損搎搖搗搵搶摀摃摋摐摑摕摙摜摟摪摫摯摲摳摶摺摻摼撈撊撋"
        "撌撏撐撓撝撟撣撥撧撫撲撳撶撻撾撿擁擃擄擇擈擊擋擓擔據擟擠擣擥擧擪擫擬擯擰擱擲"
        "擳擴擷擺擻擼擽擾攄攆攋攎攏攑攔攖攙攛攜攝攞攢攣攤攦攧攩攪攬攳敗敘敵數敺敿斁斂"
        "斃斄斅斆斕斬斷斸於旝旟昜時晉晛晝暈暉暐暘暟暢暫曄曆曇曉曊曏曖曠曥曨曬曭曮書會"
        "朥朧東柵桱桿梔梖梘梜條梟梲棄棆棖棗棟棡棧棲棶椏椚椲楇楊楎楓楨業極榝榪榮榯榲榿"
        "構槍槤槧槨槫槮槳槶槻槼樁樂樅樓標樞樠樢樣樫樲樳樸樹樺樻樿橃橅橈橋橚機橢橨橫橯"
        "檁檂檉檋檒檔檛檜檟檡檢檣檥檭檮檯檰檲檳檵檸檻檾檿櫃櫅櫍櫎櫏櫓櫚櫛櫝櫞櫟櫠櫢櫥"
        "櫧櫨櫩櫪櫫櫬櫯櫱櫳櫴櫶櫸櫹櫻櫽欄欇權欍欏欐欑欒欓欖欘欞欽歄歍歐歕歗歛歞歟歡歲"
        "歷歸歿殘殞殢殤殨殫殮殯殰殲殺殼毀毄毆毊毿氀氂氈氌氣氫氬氭氳決沒沖況洶浹浿涇涷"
        "涼淚淥淪淵淶淺渙減渢渦測渾湊湋湞湯溈準溝溡溤溫溮溰溳滄滅滌滎滬滭滯滲滷滸滻滾"
        "滿漁漊漍漎漐漙漚漢漣漬漲漵漸漿潁潑潔潕潚潛潣潤潬潯潰潷潿澀澅澆澇澐澒澖澗澠澢"
        "澤澦澩澫澬澮澰澱澾濁濃濄濆濇濊濕濘濚濛濜濟濤濧濫濰濱濺濼濾濿瀁瀂瀃瀄瀅瀆瀇瀈"
        "瀉瀋瀏瀕瀘瀙瀝瀟瀠瀢瀦瀧瀨瀯瀰瀲瀳瀴瀵瀾灃灄灍灑灒灓灕灘灙灝灟灠灡灣灤灦灧災"
        "為烏烴焛無煇煉煒煙煢煥煩煬煱煼熂熅熉熌熒熓熕熗熞熡熰熱熲熾燀燁燈燌燒燖燘燙燜"
        "營燡燦燭燰燴燵燶燼燽燾爁爃爄爍爐爓爖爛爣爥爧爭爺爾牆牋牘牼牽犅犓犖犞犢犤犧狀"
        "狹狽猌猍猙猧猶猻獁獄獅獊獎獑獖獟獢獨獩獪獫獮獰獱獲獵獷獸獹獺獻獼玀玁玂珼現琖"
        "琺琿瑋瑒瑙瑣瑤瑩瑪瑲瑻瑽璉璊璕璗璛璝璡璣璦璫璯環璵璸璹璼璽璾瓄瓅瓊瓏瓐瓓瓔瓕"
        "瓚瓛甊甌甒甖產畝畢畫異當疇疊痙痮痾瘂瘋瘍瘑瘒瘓瘞瘡瘧瘮瘱瘲瘺療癆癇癈癉癎癐癘"
        "癟癠癢癤癥癧癩癪癬癭癮癰癱癲癴發皚皟皪皰皸皺皾盜盞盡監盤盧盨盪眥眾睍睏睔睜睞"
        "睪睴瞓瞘瞛瞜瞞瞡瞤瞭瞯瞱瞶瞷瞼矇矉矊矑矓矕矖矘矚矯矲硃硜硤硨硯碙碢碩碭碸確碼"
        "碽磑磒磚磠磣磧磯磱磵磽磾礄礆礋礎礏礐礒礙礚礛礥礦礩礪礫礬礮礰礱礲礹祿禍禎禓禕"
        "禜禡禦禪禬禮禯禰禱禵禿秈稅稈稏稟種稱穀穇穌積穎穖穠穡穢穧穨穩穫穬穭窩窪窮窯窱"
        "窵窶窺竀竄竅竇竈竉竊竱競筆筍筧筴箋箏箹節範築篋篔篘篢篤篩篳篵篸篿簀簂簍簜簞簡"
        "簢簣簥簫簵簹簻簽簾籃籋籌籔籙籚籛籜籟籠籣籦籩籪籫籬籭籮籯籲粯粵粻糝糞糧糮糰糲"
        "糴糶糷糹糺糽糾紀紂紃約紅紆紇紈紉紋紌納紐紑紒紓純紕紖紗紘紙級紛紜紝紞紟紡紨紩"
        "紬紭細紱紲紳紵紶紸紹紺紼紽紾紿絀絁終絃組絅絆絇絍絎結絑絓絕絖絘絙絚絛絝絞絟絠"
        "絡絢絣絤絥給絧絨絪絯絰統絲絳絸絹絺絻絼絽絾絿綀綁綃綄綅綆綇綈綊綋綌綍綎綏綐經"
        "綕綖綜綝綞綟綠綡綢綣綧綪綬維綯綰綱網綴綵綷綸綹綺綻綼綽綾綿緀緁緂緄緅緆緇緉緊"
        "緋緌緍緎総緒緓緔緗緘緙線緛緝緞緟締緡緢緣緤緦緧編緩緪緫緬緮緯緰緱緲練緵緶緷緸"
        "緹緺緻縈縉縊縋縌縍縎縐縑縒縓縕縖縗縚縛縜縝縞縟縡縣縧縩縪縫縬縭縮縯縰縱縲縳縴"
        "縵縶縷縸縹縺縼總績縿繀繂繃繅繆繈繎繏繐繑繒繓織繕繖繗繘繙繚繜繞繟繡繢繣繨繩繪"
        "繫繬繭繮繯繰繲繳繵繶繷繸繹繻繼繽繾繿纀纁纃纆纇纈纊纋續纍纏纑纓纔纕纖纗纘纚纜"
        "缽罃罆罈罌罏罰罵罷罼羂羅羆羈羋羥義羵習翜翬翹翽翿耬耮聖聞聯聰聲聳聵聶職聹聻聽"
        "聾肅脅脈脛脥脫脹腎腖腡腦腪腫腳腸膃膒膕膚膞膠膢膩膮膴膶膷膹膽膾膿臇臉臍臏臗臘"
        "臚臟臠臡臢臤臨臺與興舉舊艙艛艜艤艦艫艭艱艷芻苧茲荊莊莖莢莧菕華萇萊萬萯萴萵葉"
        "葒著葝葤葦葷葻蒍蒒蒔蒞蒭蒳蒶蒼蓀蓋蓮蓯蓲蓴蓽蔄蔎蔔蔞蔠蔣蔥蔦蔪蔭蔮蔯蔱蕁蕄蕆"
        "蕎蕑蕒蕓蕕蕘蕝蕟蕡蕢蕧蕩蕪蕭蕳蕷蕽薀薆薈薉薊薋薌薑薔薖薘薟薠薦薩薱薲薳薴薵薺"
        "藇藉藍藎藖藘藚藝藣藥藪藬藭藰藶藷藹藺藾蘀蘄蘆蘇蘈蘊蘋蘚蘞蘟蘡蘢蘫蘬蘭蘱蘵蘹蘺"
        "蘿虅虆虉處虛虜號虦虧虯蛵蛺蛻蛼蜆蜦蜸蜽蝀蝁蝕蝜蝟蝦蝸螄螘螞螢螮螴螹螻螿蟂蟄蟈"
        "蟎蟘蟜蟡蟣蟦蟬蟯蟱蟲蟳蟶蟷蟻蟽蠀蠁蠅蠆蠈蠌蠐蠑蠒蠙蠞蠟蠣蠦蠨蠪蠱蠳蠶蠻蠾衊術"
        "衕衚衛衝袞裊裌補裝裡裲製複褌褘褭褲褳褸褺褻襀襂襇襌襏襓襖襗襘襛襝襠襤襨襪襬襭"
        "襯襰襱襲襴襵襸襹襼覆見覎規覒覓覕視覗覘覛覜覟覠覡覢覤覥覦覩親覬覭覯覰覲覴覶覷"
        "覸覹覺覻覼覽覿觀觴觶觷觸觹觻觽訁訂訃訆計訊訌討訏訐訑訒訓訕訖託記訛訜訝訞訟訢"
        "訣訥訦訧訨訩訪訬設訰許訴訶訸訹診註訽詀詁詃詄詅詆詇詉詊詌詍詎詏詐詑詒詓詔評詖"
        "詗詘詛詜詝詞詠詡詢詣詥試詨詩詪詫詬詭詮詯詰話該詳詴詵詶詷詺詻詼詿誂誃誄誅誆誇"
        "誋誌認誎誏誐誑誒誔誕誗誘誙誚誜語誠誡誣誤誥誦誧誨說誫誰課誳誴誶誷誹誺誻誼誽誾"
        "調諁諂諃諄諆談諈諉請諍諎諏諑諒諓諔諕論諗諛諜諝諞諟諠諢諣諤諥諦諧諩諫諭諮諯諰"
        "諱諲諳諴諶諷諸諹諺諻諼諾謀謁謂謄謅謆謉謊謋謌謍謎謏謐謑謔謖謗謙謚講謜謝謞謟謠"
        "謣謥謨謫謬謭謯謰謱謲謳謴謵謸謹謻謼謾譀譂譄譅譆譇譈證譊譌譎譏譐譑譓譔譖識譙譚"
        "譜譞譟譠譡譨譩譫譯議譳譴護譸譹譺譻譼譽譾譿讀讂讅讆讇讉變讋讌讎讑讒讓讔讕讖讘"
        "讙讚讛讜讝讞讟豄豅豈豎豐豬豵豶貓貗貙貝貞貟負財貢貣貤貦貧貨販貪貫責貯貰貱貲貳"
        "貴貶買貸貺費貼貽貾貿賀賁賂賃賄賅資賈賊賑賒賓賕賗賙賚賜賝賞賟賠賡賢賣賤賥賦賧"
        "賨質賬賭賮賰賴賵賶賸賹賺賻購賽賾贃贄贅贆贇贈贉贊贋贍贏贐贑贓贔贕贖贗贙贚贛赬"
        "趕趙趨趫趬趲跡踐踚踴蹌蹔蹕蹛蹡蹣蹤蹥蹪蹳蹺蹻躀躂躉躊躋躍躎躑躒躓躕躘躚躝躡躥"
        "躦躧躪軀軂軃軇軉車軋軌軍軎軏軑軒軓軔軕軖軗軘軛軜軝軞軟軤軥軧軨軫軬軮軯軱軲軳"
        "軵軷軸軹軺軻軼軾軿輀輁輂較輄輅輆輇輈載輊輋輐輑輒輓輔輕輖輗輘輙輚輛輜輝輞輟輠"
        "輡輢輣輤輥輦輨輩輪輫輬輮輯輲輳輴輵輶輷輸輹輻輾輿轀轂轃轄轅轆轇轈轉轊轍轎轏轐"
        "轑轒轓轔轕轖轗轘轙轚轛轝轞轟轠轡轢轣轤轥辦辭辮辯農迴逕這連進逿運過達違遙遜遞"
        "遠適遰遱遲遶遷選遺遼邁還邇邊邏邐郟郲郵鄆鄉鄒鄔鄖鄟鄡鄦鄧鄩鄪鄬鄭鄮鄰鄲鄳鄴鄶"
        "鄺酇酈醆醜醞醦醧醫醬醱醲醳醶釀釁釃釅釋釐釒釓釔釕釗釘釙釚釛針釟釣釤釥釦釧釨釩"
        "釪釫釬釭釱釲釳釴釵釷釹釺釽釾釿鈀鈁鈂鈃鈄鈆鈇鈈鈉鈋鈍鈎鈏鈐鈑鈒鈓鈔鈕鈖鈗鈚鈛"
        "鈜鈞鈠鈣鈤鈥鈦鈧鈪鈮鈯鈰鈲鈳鈴鈵鈶鈷鈸鈹鈺鈼鈽鈾鈿鉀鉁鉅鉈鉉鉊鉋鉌鉍鉎鉏鉐鉑"
        "鉒鉔鉕鉗鉘鉙鉚鉛鉜鉝鉞鉟鉠鉡鉤鉥鉦鉧鉨鉬鉭鉮鉲鉵鉶鉷鉸鉹鉺鉻鉼鉽鉾鉿銀銁銂銃"
        "銅銈銊銋銍銏銑銓銔銖銗銘銙銚銛銜銠銡銣銥銦銧銨銩銪銫銬銱銲銳銶銷銸銹銻銼銾鋁"
        "鋂鋃鋅鋇鋉鋊鋋鋌鋍鋏鋐鋒鋗鋘鋙鋜鋝鋟鋠鋡鋣鋤鋥鋦鋧鋨鋩鋪鋮鋯鋰鋱鋶鋸鋹鋼鋾錀"
        "錁錂錄錆錇錈錋錍錏錐錑錒錔錕錗錘錙錚錛錜錝錞錟錠錡錢錣錤錥錦錧錨錩錪錫錭錮錯"
        "錳錶錸錽鍀鍁鍂鍃鍄鍆鍇鍈鍉鍊鍋鍍鍏鍐鍑鍒鍔鍖鍘鍚鍛鍜鍝鍟鍠鍡鍣鍤鍥鍦鍧鍨鍩鍬"
        "鍭鍮鍯鍰鍱鍴鍵鍶鍺鍼鍾鎂鎄鎅鎇鎈鎉鎊鎋鎌鎍鎑鎒鎓鎔鎕鎖鎗鎘鎙鎚鎛鎝鎞鎡鎢鎣鎦"
        "鎧鎩鎪鎬鎮鎯鎰鎲鎳鎵鎶鎷鎿鏁鏂鏃鏆鏇鏈鏉鏌鏍鏏鏐鏑鏒鏓鏔鏕鏗鏘鏙鏚鏜鏝鏞鏟鏡"
        "鏢鏤鏥鏦鏨鏩鏰鏵鏷鏸鏹鏺鏻鏽鏾鐀鐁鐃鐄鐇鐈鐉鐊鐋鐍鐎鐏鐐鐒鐓鐔鐕鐖鐘鐙鐚鐝鐠"
        "鐤鐥鐦鐧鐨鐩鐪鐫鐬鐮鐯鐲鐳鐴鐵鐶鐸鐹鐺鐼鐽鐿鑀鑄鑇鑈鑉鑊鑋鑌鑏鑐鑑鑒鑔鑕鑖鑘"
        "鑙鑛鑞鑠鑡鑢鑣鑥鑨鑪鑭鑮鑯鑰鑱鑲鑴鑷鑸鑹鑼鑽鑾鑿钀钁钃長門閂閃閄閅閆閈閉開閌"
        "閍閎閏閐閑閒間閔閕閗閘閛閜閝閞閟閡閣閤閥閦閧閨閩閫閬閭閯閱閵閶閷閹閻閼閽閾閿"
        "闃闄闆闇闈闉闊闋闌闍闐闑闒闓闔闕闖闚闛關闞闟闠闡闢闤闥阪陘陝陣陰陳陸陽陿隉隊"
        "階隑隕隖際隤隨險隫隮隯隱隲隴隸隻雋雖雙雛雜雞離難雲電霢霣霧霼霽靂靄靅靆靈靉靚"
        "靜靦靧靨鞀鞏鞝鞦鞸鞻鞼鞽鞾韁韃韆韇韉韊韋韌韍韏韐韒韓韔韗韘韙韚韛韜韝韞韠韡韢"
        "韣韻響頁頂頃頄項順頇須頊頌頍頎頏預頑頒頓頔頕頖頗領頛頜頞頟頠頡頢頤頦頩頪頫頭"
        "頮頯頰頲頴頵頷頸頹頻顀顁顃顄顅顆顇顉顊顋題額顎顏顐顑顒顓顖顗願顙顛顜顝類顠顢"
        "顣顤顥顦顧顩顪顫顬顮顯顰顱顳顴風颩颬颭颮颯颰颱颲颳颴颶颷颸颹颺颻颼颽颾颿飀飁"
        "飂飄飆飇飈飉飋飍飛飠飢飣飤飥飦飩飪飫飭飯飰飲飴飵飶飷飼飽飾飿餀餂餃餄餅餉養餌"
        "餎餏餑餒餓餔餕餖餗餘餚餛餜餞餟餡餢餣餤餦餧館餩餪餫餬餭餯餰餱餲餳餴餵餶餷餸餹"
        "餺餼餾餿饀饁饃饅饆饇饈饉饊饋饌饎饐饒饗饘饙饛饜饞饟饠饡饢馩馬馭馮馯馱馲馳馴馵"
        "馹馺馼馽駁駂駃駉駊駍駎駏駐駑駒駓駔駕駗駘駙駚駛駜駝駞駟駢駣駤駥駧駩駪駫駬駭駮"
        "駰駱駴駶駷駸駹駺駻駼駽駾駿騀騁騂騃騄騅騇騉騊騋騌騍騎騏騑騔騕騖騗騙騚騜騝騞騟"
        "騠騢騣騤騥騧騩騪騫騬騭騮騯騰騱騲騳騴騵騶騷騸騹騺騻騼騽騾驀驁驂驃驄驅驈驉驊驋"
        "驌驍驎驏驐驒驓驔驕驖驗驙驚驛驞驟驠驡驢驤驥驦驨驩驪驫骯髏髐髒體髕髖髮鬆鬍鬖鬗"
        "鬚鬜鬝鬞鬠鬡鬢鬥鬧鬩鬮鬱鬹鬺魎魗魘魚魛魜魝魟魠魡魢魣魥魦魧魨魪魫魬魭魮魯魱魴"
        "魵魶魷魺魻魼魽魾鮀鮁鮂鮃鮄鮅鮆鮇鮈鮊鮋鮌鮍鮎鮏鮐鮑鮒鮓鮗鮘鮚鮛鮜鮞鮟鮠鮡鮣鮤"
        "鮥鮦鮧鮨鮪鮫鮬鮭鮮鮯鮰鮳鮵鮶鮷鮸鮹鮺鮻鮿鯀鯁鯄鯅鯆鯇鯈鯉鯊鯌鯒鯔鯕鯖鯗鯚鯛鯝"
        "鯞鯠鯡鯢鯤鯥鯦鯧鯨鯩鯪鯫鯬鯮鯰鯱鯴鯶鯷鯸鯹鯻鯼鯽鯾鯿鰁鰂鰃鰅鰆鰇鰈鰉鰊鰋鰌鰍"
        "鰏鰐鰑鰒鰓鰕鰗鰛鰜鰝鰟鰠鰡鰣鰤鰥鰦鰧鰨鰩鰫鰬鰭鰮鰯鰱鰲鰳鰴鰵鰶鰷鰹鰺鰻鰼鰽鰾"
        "鰿鱀鱁鱂鱃鱄鱅鱆鱇鱈鱉鱊鱋鱌鱍鱎鱏鱐鱑鱒鱓鱔鱕鱖鱗鱘鱚鱝鱞鱟鱠鱢鱣鱤鱥鱦鱧鱨"
        "鱬鱭鱮鱯鱲鱴鱵鱷鱸鱹鱺鱻鳥鳦鳧鳩鳭鳱鳲鳳鳴鳶鳷鳸鳺鳻鳼鳽鳾鳿鴀鴁鴂鴃鴅鴆鴇鴉"
        "鴍鴐鴒鴓鴔鴕鴗鴘鴙鴚鴛鴜鴝鴞鴟鴠鴡鴢鴣鴥鴦鴨鴩鴮鴯鴰鴱鴲鴳鴴鴶鴷鴸鴹鴺鴻鴽鴾"
        "鴿鵀鵁鵂鵃鵄鵅鵊鵋鵌鵎鵏鵐鵑鵒鵓鵔鵕鵖鵗鵙鵚鵛鵜鵝鵟鵠鵡鵧鵩鵪鵫鵬鵮鵯鵰鵱鵲"
        "鵳鵴鵵鵶鵷鵸鵹鵻鵼鵽鵾鶀鶂鶃鶄鶅鶆鶇鶉鶊鶋鶌鶒鶓鶔鶕鶖鶗鶘鶙鶚鶛鶝鶞鶟鶠鶡鶢"
        "鶣鶤鶥鶦鶨鶩鶪鶬鶭鶯鶰鶱鶲鶴鶵鶶鶷鶹鶺鶻鶼鶽鷀鷁鷂鷃鷅鷇鷈鷉鷊鷋鷎鷏鷐鷑鷒鷓"
        "鷔鷕鷖鷗鷙鷚鷛鷜鷞鷟鷢鷣鷤鷥鷦鷧鷨鷩鷫鷭鷮鷯鷰鷲鷳鷵鷶鷷鷸鷹鷺鷽鷾鷿鸀鸁鸂鸃"
        "鸄鸅鸆鸇鸉鸊鸋鸌鸎鸏鸐鸑鸒鸓鸕鸖鸗鸘鸙鸚鸛鸜鸝鸞鹵鹹鹺鹼鹽麗麡麥麧麨麩麬麮麯"
        "麰麱麲麳麴麵麷麼麽黂黃黌點黨黲黴黶黷黸黽黿鼀鼁鼄鼅鼆鼈鼉鼊鼕鼚鼲鼴齈齊齋齌齍"
        "齎齏齒齔齕齖齗齘齙齚齜齝齞齟齠齡齣齤齥齦齧齩齪齬齭齮齯齰齱齲齳齴齵齶齷齸齹齺"
        "齻齼齽齾龍龎龏龐龑龓龔龕龖龜龝龞龥龭龯龲龻龽鿁鿐鿓"
    )
    # '齻齼齽齾龍龎龏龐龑龓龔龕龖龜龝龞龥龭龯龲龻龽鿁鿐鿓鿠鿳 4 E′5‸5‹2‾2‾E⁀7⁀A⁀D⁂E'\
    # '⁃D⁄7⁅9⁇2⁚B F⁢5⁳2⁷F⁸6⁺D⁾A₀E₀F₁D₂B₥8₦C₱9⃕4⃕8⃗9⃛8⃛9⃜C⃜F⃥B⃩6⃪E⃱7⃲4⃲E⃴8⃷8⃺C⃽5⃽8⃿F'\
    # 'ℂ0℃F℅A℆F℉2ℊ1ℋFℌ4ℌ8ℎ4ℑ4ℑ6ℒ3ℒ4ℒ9℔Fℕ8№5№7ℶB⅄D⅄EⅆDⅆF⅋6⅌1⅍7ⅎ6⅏E⅜6ⅻ5ⅾBↁAↃ9ↈ3↉8↋F↎8'\
    # '→0→1→B↸9↺3↺4⇏3⇞8⇡7⇦C⇪0⇪8⇳1⇳E⇵7⇷3⇷5⇸6⇻1⇽6∑3∓C∖1∖3∧F∨3∷0≁7≖9≙5≭4≲D⊃0⊃C⊈0⊌F⊍0⊍A'\
    # '⊎D⊐C⊑C⊒7⊒9⊓1⊓F⊖0⊾6⊾9⊿7⋆1⋉0⋊9⋊B⋋8⋋E⋌2⋍A⋒6⋒9⋖3⋙1⋙2⋚B⋜3⋜F⋝E⋞E⋠1⋡4⋡9⋣3⋣4⋣8⋤F⋦5⋧C'\
    # '⋧F⋨E⋫3⋽3⋾1⌁8⌃7⌃B⌓8⌣6〉F⌬B⌭E⌰2⌵0⌸4⌹C⍓F⍤E⍧F⍩9⍮3⍵5⍸1⍹0⍻B⎁5⎂9⎃2⎄C⎇6⎐B⎓F⎥5⎭2⎾9⎿4⎿6'\
    # '⏁B⏂8⏐7⏚F⏬F⏭1⏰A⏲9⏴F⏻7⏼9␂A␆3␆A␑9␓7␕9␖9␗7␟E␵6␵C␺4␻1␽0⑇3⑇9⑈E⑊6⑋B⑌C⑌E⑍3①0⑮E⑯1⑰6⑾4'\
    # '⒁4⒂E⒇2⒉F⒌E⒎4⒖D⒤2⒪4⒫A⒮9⒰5Ⓔ6Ⓣ3Ⓤ2Ⓩ7Ⓩ8ⓜ3ⓟDⓢBⓨ9ⓩ4⓭C⓭D⓯2⓰8⓸9│C┃2┊B┋8┝4┧8┭D┰3┱A┽D═2'\
    # '╖5╘5╘F╚9╛2╜7╟4╟9╟A╟D╠3╱0╳0╻5█A▊2▋6▋7□0▨2▾4◇8◌A◒8◓C◔3◔A◕B◕C◕D◢0◫C◮4◮6◯5◳6◳D◵6'\
    # '◶D◷D◸2◹D◺F◼9◼A◾F☀E☁6☄4★5☆7☈5☈B☌4☍2☍8☎9☐B☐D☒7☓C☔7☔8☔B☕8☗7☘6☘8☛2☜E☝B☳E☴6☻9☽1♈0'\
    # '♑6♢7♱6♹B♽0♿C⚀5⚄F⚅6⚅D⚆7⚇6⚈8⚌7⚌E⚖F⚟4⚟A⚪D⚫D⛄C⛍D⛕5⛘6⛣7⛪3⛵2⛸F⛻5⛻6⛼D✇F✈5✏D✵5✿B❁0❃1'\
    # '❉6❊F❒5❕F❖6❚6❯8❰1❰2❱7❲3❳5❳6❵E❸5❹4❺3❺B❻6❼C➀8➂5➃5➄D➆A➇4➇8➈3➈4➈D➊2➏4➖3➗A➙D➚6➚7➚D'\
    # '➝D➞D➟5➟8➠A➡D➣3➣E➥5➥9➦6➦7➦A➧C➩E➪1➪6➪A➪E➭A➭D➰1➰5➰7➰C➲4➲8➲A➲E➲F➳B➴8➷9➸6➸7➸8➹3⟀6'\
    # '⟀E⟇B⟍F⟒A⟔A⟗3⟘4⟙4⟙F⟚7⟛2⟜E⟝B⟡6⟡8⟢6⟢A⟢B⟤8⟶2⟶F⟷5⟺5⠄2⠉0⠍8⠍C⠐9⠒3⠓0⠔D⠘5⠘9⠚A⠛1⠜1⠜D⠝7'\
    # '⠝E⠞4⠞F⠟0⠟D⠠0⠠6⠠7⠠A⠠C⠥6⠧9⠪0⠫0⠫8⠫9⠫B⠬1⠭A⠮2⠮E⠰4⠰8⠴8⠴F⠵0⠵2⠷0⠷9⠸C⠺9⠺A⠺E⠽2⠽4⠾0⠾5⡃6'\
    # '⡄A⡠C⡺8⡺A⡻A⡼A⢋F⢌3⢌8⢌9⢍E⢎7⢎8⢐B⢒1⢓B⢕B⢕C⢕F⢖6⢗A⢚1⢚B⢛1⢜0⢝0⢝A⢝C⢞B⢟0⢟1⢠F⢡B⢡D⢢2⢢F⢣9⢦8'\
    # '⢧0⢨5⢨B⢩5⢬0⢭2⢯C⢰2⢱2⢱6⢱E⢱F⢴3⢴6⢴C⢴E⢵0⢵6⢵7⢵A⢵B⢶5⢷8⢸1⢸2⢸5⢻0⢻3⢼5⢽F⢿5⣀3⣀B⣂0⣂5⣂D⣃2⣃5'\
    # '⣃7⣃9⣆5⣊D⣋3⣌C⣍0⣍1⣍2⣍5⣍9⣍A⣎8⣏8⣏F⣑1⣑7⣒4⣓9⣔6⣔C⣕7⣖4⣖6⣖9⣖C⣗8⣘0⣘F⣙1⣚E⣚F⣛0⣛2⣛B⣛F⣜8⣟2'\
    # '⣟B⣳3⣴8⣴F⤂8⤕9⤖6⤗E⤜9⤤D⤥9⤬C⤯0⤵C⤹2⤹5⤹6⤹F⤺0⤺2⤼2⤼C⤾0⤾A⤿4⤿7⥀C⥄3⥅2⥅4⥆1⥆3⥆6⥈E⥉C⥉D⥋2⥋A'\
    # '⥋C⥎3⥎5⥏8⥏9⥐7⥐8⥐A⥑1⥒3⥓3⥔A⥗0⥘1⥛0⥛F⥜0⥝3⥝B⥞1⥟4⥠0⥡A⥡D⥣9⥣A⥣B⥤8⥨5⥩A⥩B⥪5⥪9⥫5⥬6⥬C⥬E⥭E'\
    # '⥮1⥮9⥯2⥰7⥲0⥲6⥲F⥳0⥳5⥳6⥵1⥵4⥶0⥶1⥶3⥶7⥷D⥸3⥸4⥸6⥸9⥺1⥺6⥺7⥺C⥺F⥼0⥼2⥽0⥽7⥾0⦃4⦆3⦆4⦇A⦈D⦊1⦋0'\
    # '⦋2⦋4⦋8⦋C⦋E⦌A⦌B⦌F⦍1⦍4⦎1⦎B⦏5⦏A⦐A⦑9⦓2⦓5⦓8⦔3⦔4⦔5⦔7⦔9⦔E⦕1⦗2⦗C⦘3⦙A⦚0⦛A⦜6⦜9⦝0⦞2⦵9⦶F'\
    # '⦼1⦼3⦼6⦿3⧀0⧃9⧄8⧎4⧐6⧓5⧕A⧖6⧖9⧗1⧗9⧗A⧘0⧘1⧙8⧚F⧛0⧛1⧝2⧝3⧝5⧟0⧟6⧠3⧠4⧠6⧢1⧢3⧢4⧢6⧢9⧢C⧤2⧤A'\
    # '⧤E⧥D⧧D⧧E⧩D⧩E⧭7⧭B⧮7⧮C⧮E⧯0⧯1⧱4⧳6⧴5⧴7⧴8⧵4⧷7⧹0⧹2⧹D⧼5⧼A⧾4⧾7⧾A⧿1⧿A⨀9⨁6⨁7⨁A⨁B⨂6⨃B⨃E'\
    # '⨄8⨄F⨅0⨅1⨅6⨅B⨅C⨇1⨇F⨈6⨈8⨊9⨊B⨌3⨌D⨌F⨍2⨎6⨎7⨎E⨏F⨐5⨐6⨑5⨒0⨓2⨓3⨔2⨔3⨕6⨕C⨗E⨘3⨚B⨛0⨛4⨛7⨜4'\
    # '⨝6⨝8⨟0⨟3⨠F⨡4⨡7⨣C⨥6⨥C⨦3⨦8⨦E⨧1⨧8⨧F⨨9⨬8⨯C⨯D⨯F⨱0⨱2⨱7⨱8⨱C⨲3⨲8⨲C⨲D⨲E⨲F⨳0⨳D⨳E⨳F⨴0⨴7'\
    # '⨴D⨵1⨵2⨵3⨵8⨵A⨵E⨶0⨶3⨶4⨶C⨷4⨷6⨷7⨷F⨸2⩅A⩇3⩊C⩋F⩍B⩎C⩏0⩏9⩏D⩓5⩖3⩚8⩜B⩝C⩝D⩞A⩞D⩟3⩟B⩟D⩠0⩠5'\
    # '⩡3⩡E⩢5⩢7⩢8⩢9⩢C⩢F⩣2⩤9⩤D⩤F⩥1⩥5⩥E⩦4⩨5⩩4⩪3⩪D⩪E⩫0⩭5⩵6⩷5⩽6⪈D⪊5⪻0⪼2⫏7⫒5⫖2⫝̸8⬍0⬍1⬍E⬎5'\
    # '⬏7⬐7⬞0⬣9⬤D⬭0⬮7⬱9⬵8⭉E⭊1⭊2⭋7⭑8⭒1⭙E⭝1⭝5⭟B⭲6⮏4⮕D⮙4⮙9⮛8⮝D⮡1⮩B⮰6⮳1⮽3⯋4⯚6⯭1⯺1ⰑDⰘ9Ⱖ4'\
    # 'Ⱖ7ⰲ6ⰴ1ⰿ2ⱆ1ⱉ2ⱎ1ⱜFⱟAⱥ4Ɑ5ⲁ0ⲌDⲍ8ⲗ2ⲝ9Ⲹ7ⲸDⲽ8Ⳅ2Ⳅ8ⳉAⳉBⳔ2Ⳕ3Ⳗ8ⳖEⳛCⳤ2ⴉ6ⴧEⵅ9ⵞ1ⶉ2⶝2⶝6ⶢ1ⷅ8'\
    # 'ⷙ9⹱7⹿D⺄8⺐F⺑2⺙7⺢D⺣B《0》4』4〡D〤0〬6〻Cげ0げBこAせBぢFと2な3ぶ2まBゅ3ガ6ガFキBク3タ2バFヒ6ビDヤ8ロEヾ2ㄎ1'\
    # 'ㄎ2ㄎAㄚ5ㄜB'
    __p_zh_t: ClassVar[regex.Pattern[str]] = regex.compile(
        rf"(?![{__JAPANESE_KANJIS_SEQUENCE_1ST}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_2ND_JOYO}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_3RD_JOYO}])"
        + rf"(?=[{__CHINESE_KANJIS_SEQUENCE_TRADITIONAL}])"
    )
    #
    __p_zh_all: ClassVar[regex.Pattern[str]] = regex.compile(
        rf"(?![{__JAPANESE_KANJIS_SEQUENCE_1ST}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_2ND_JOYO}"
        + rf"{__JAPANESE_KANJIS_SEQUENCE_3RD_JOYO}])"
        + r"(?=[\p{Script=Han}])"
    )
    #
    __lang_from_converters: ClassVar[dict[TERTransService, dict[str, str]]] = {
        TERTransService.DEEPLKEY: {
            str(googletrans.LANGCODES["norwegian"])  # type: ignore
            .casefold()
            .strip(): deepl.Language.NORWEGIAN.casefold()
            .strip(),
            str(googletrans.LANGCODES["chinese (simplified)"])  # type: ignore
            .casefold()
            .strip(): deepl.Language.CHINESE.casefold()
            .strip(),
            str(googletrans.LANGCODES["chinese (traditional)"])  # type: ignore
            .casefold()
            .strip(): deepl.Language.CHINESE.casefold()
            .strip(),
        },
        TERTransService.DEEPLTRANSLATE: {
            str(googletrans.LANGCODES["chinese (simplified)"])  # type: ignore
            .casefold()
            .strip(): deepl.Language.CHINESE.casefold()
            .strip(),
            str(googletrans.LANGCODES["chinese (traditional)"])  # type: ignore
            .casefold()
            .strip(): deepl.Language.CHINESE.casefold()
            .strip(),
        },
    }

    @classmethod
    def detect_cj(
        cls,
        _text: str,
        _service: TERTransService,
    ) -> str | None:
        if _service in [
            TERTransService.DEEPLKEY,
            TERTransService.DEEPLTRANSLATE,
        ]:
            if cls.__p_ja_kana.search(_text) is not None:
                return deepl.Language.JAPANESE.casefold().strip()
            elif cls.__p_zh_all.search(_text) is not None:
                return deepl.Language.CHINESE.casefold().strip()
            elif cls.__p_ja_kanji.search(_text) is not None:
                return deepl.Language.JAPANESE.casefold().strip()
            else:
                return None
        elif _service in [
            TERTransService.GOOGLETRANS,
            TERTransService.GOOGLEGAS,
        ]:
            if cls.__p_ja_kana.search(_text) is not None:
                return (
                    str(googletrans.LANGCODES["japanese"])  # type: ignore
                    .casefold()
                    .strip()
                )
            elif cls.__p_zh_s.search(_text) is not None:
                return (
                    str(
                        googletrans.LANGCODES["chinese (simplified)"]  # type: ignore
                    )
                    .casefold()
                    .strip()
                )
            elif cls.__p_zh_t.search(_text) is not None:
                return (
                    str(
                        googletrans.LANGCODES["chinese (traditional)"]  # type: ignore
                    )
                    .casefold()
                    .strip()
                )
            elif cls.__p_zh_all.search(_text) is not None:
                return (
                    str(
                        googletrans.LANGCODES["chinese (simplified)"]  # type: ignore
                    )
                    .casefold()
                    .strip()
                )
            elif cls.__p_ja_kanji.search(_text) is not None:
                return (
                    str(googletrans.LANGCODES["japanese"])  # type: ignore
                    .casefold()
                    .strip()
                )
            else:
                return None
        else:
            assert False, f"Translation service is {_service}."

    @classmethod
    def convert_from(
        cls,
        _lang_from_g_detection: str,
        _service: TERTransService,
    ) -> str:
        return cls.__lang_from_converters.get(_service, {}).get(
            _lang_from_g_detection, _lang_from_g_detection
        )
